//
// Created by 1000308297 on 7/5/2017.
//


#include <string.h>
#include <stdio.h>
#include <stdlib.h>
#include <android/log.h>
#include <android/bitmap.h>
#include <jni.h>
#include <sys/mman.h>
#include <sys/stat.h>
#include <fcntl.h>
#include <unistd.h>
#include <pthread.h>
#include <sched.h>
#include <errno.h>
#include <sys/time.h>
#include <sys/ioctl.h>
#include <time.h>
#include <math.h>
#include <sys/system_properties.h>
#include <CL/cl.h>

//------------------------------------------------------------------------------

#define  LOG_TAG    "Tp_NATIVE"
#define  LOGI(...)  __android_log_print(ANDROID_LOG_INFO,LOG_TAG,__VA_ARGS__)
#define  LOGW(...)  __android_log_print(ANDROID_LOG_WARN,LOG_TAG,__VA_ARGS__)
#define  LOGE(...)  __android_log_print(ANDROID_LOG_ERROR,LOG_TAG,__VA_ARGS__)

// Set to 1 to enable debug log traces
#define DEBUG 1

//------------------------------------------------------------------------------
//  include h

typedef unsigned char u8;
typedef unsigned short u16;
typedef unsigned int u32;
typedef unsigned long u64;

typedef char s8;
typedef short s16;
typedef int s32;
typedef long s64;

// For setting USB property to accessory mode
char kstr_accessory[]="accessory";
char kstr_adb[]="mtp,adb";
char sysusb_now[] = "";
char kstr_sysusb[]="sys.usb.config";

char kstr_camera_optimization[]="persist.camera.isp.clock.optmz";
char kstr_zero[]="0";

// HASS sensor is now configured for imx290
//   these are used for raw_filhdr generation at get_raw_cfei()
#define  RSENSOR_BPP       10
// Bayer
#define  RSENSOR_MEDGE     8
// may not be right -- need to encode one of RGGB GRBG GBRG BGGR
#define  RSENSOR_PMOD      0
// default - processing stream may attach flags passing through
#define  RSENSOR_FLGS      0

// android keyboard constants
// from here, you can look up any value
// https://developer.android.com/reference/android/view/KeyEvent.html

#define  akb_KEYCODE_BACK     (0x00000004)

// crash codes
#define  CRASH_none       (0x0000)   // default - no crash
#define  CRASH_SELFCHK    (0x0001)   // test interface - shutdown on command
#define  CRASH_MEMCTRL    (0x0002)   // memctrl failure
#define  CRASH_CFEIFMT    (0x0003)   // get_raw_cfei() - MU_thread1
#define  CRASH_JCAMERA    (0x0004)   // Java side commanded crash
#define  CRASH_OPENCL     (0x0005)   // OpenCL major failure
#define  CRASH_UTPSYS     (0x0006)   // something in UTP process way out

typedef struct {
    void*    fwrd;   // 0x00
    void*    rvrs;  	// 0x08
} lnklst;

//
// there's not much call for this specific type
//  it's a useful construct to think of a linked list element as a chain
//   link carrying an unsigned parameter array
//    we can sort the link elements by a particular parameter index
//
// refer to routine lnklst_fsrchup()
//
typedef struct {
    lnklst        chain;       // 0x00..0x0F
    u64           p[16];       // 0x10..
} lnklst_upa;

//
// minimally, this must be set to 1 to prevent wrap
//  optionally, if you want to support "unget()" stupidity at this buffer
//   you have to pad it for the most unanswered unget's you expect to perform here
//
#define BPTRQUEUE_SAFE   0x10

typedef struct {
    int    push;
    int    pull;
    int    mask;
    int    spr0C;
    char*  body;
} bptrqueue;

typedef struct {
    int    push;
    int    pull;
    int    mask;
    int    tok;
    char*  body;
} bptrquetx;

// the lnklst takes 0x10 as two void*
//  then the remaining fields of an MBLK are home address (which is essentially a void*) -> size 8
//                                       and block size - which we may as well make a u64 -> size 8
#define MBLK_SIZE           (0x0020)
// this is the minimum unit our memctrl can deliver
//  generally we think that the ARM cache resolution is 32 bytes (0x20)
//   which in this case happens to be the same as MBLK_SIZE
// but is you try to malloc 1 byte -- anything less than MEMBLKUNIT
//  when the call succeeds, you will get minimally MEMBLKUNIT whether or not you asked for it
//   this is the granularity with which memctrl routines will issue memory
#define MEMBLKUNIT          (0x0100)                // power of 2 (0x80 is minimum)
// this must hold true, even if we change MEMBLKUNIT
#define MEMBLKMASK          (MEMBLKUNIT-1)
// so if we get the minimum allocation to a malloc(1), we'll get MEMBLKUNIT bytes
//  this represents the number of MBLK's in the minimal allocation of MEMBLKUNIT
#define MEMBLKMBLK          (MEMBLKUNIT/MBLK_SIZE)

typedef struct {
    lnklst        freepool;    // 0x00
    lnklst        mallpool;    // 0x10
    lnklst        mblkpool;    // 0x20
    volatile int  hwsema;      // 0x30
    u32           spr[3];      // 0x34..0x3F
} memctrl;

typedef struct {
    lnklst        chain;       // 0x00..0x0F
    u64           addr;        // 0x10
    u64           size;        // 0x18
} memblk;

#define MEMGBLKXFER         (0x0400)
#define GBLK64REFRESH       (MEMGBLKXFER>>6)

typedef struct {
    lnklst        chain;                 // 0x00..0x0F
    char*         scratch[48];           // 0x10..0x3F
} gblk_64;






typedef struct {
    lnklst           chain;    // 0x00..0x0F
    volatile int     sema;     // 0x10
    u32              spr;      // 0x14
} msg_queue;               // size 0x18

typedef int (*gblkfnc)(void* ioptr);

// the general concept is to call a function (fnc)
//  whose first argument is the dst* pointer for output
//     -- implicitly if dst==NULL, it's a function returning void
//  it can take up to 3 input arguments
//   we also need to specify which msg queue gets the message
//  the function returns an int that describes post disposal
//   for default retval=0, the message service routine automatically
//    releases the message as gblk_64
//     but if the message container (which may be some other object)
//      needs to be released differently, or gets passed on,
//       the execution of the function inherits the responsiblity to insure
//        the message is eventually releaded by other means
//         and returns non restval

typedef struct {
    lnklst           chain;    // 0x00..0x0F
    gblkfnc          fncptr;   // 0x10
    void*            dstptr;   // 0x18
    s64              arg0;     // 0x20
    s64              arg1;     // 0x28
    s64              arg2;     // 0x30
    volatile int*    doneptr;  // 0x38
} msg_gblkfnc;             // 0x40 size of gblk

#define J2JCMD_none       0x0000
#define J2JCMD_IMGVW      0x0001
//#define J2JCMD_FTUART     0x0002
#define J2JCMD_FTUART     0x0054

#define J2JST_IDLE        0x00
#define J2JST_WAIT        0x01

//
// typedef struct {
//    lnklst           chain;    // 0x00..0x0F
//    gblkfnc          fncptr;   // 0x10
//    void*            dstptr;   // 0x18
//    s64              arg0;     // 0x20
//    s64              arg1;     // 0x28
//    s64              arg2;     // 0x30
//    volatile int*    doneptr;  // 0x38
//    } msg_gblkfnc;             // 0x40 size of gblk
//
// based on msg_gblkfnc, the spec for a j2j communication
//  gets sent to thread 0
//   it always signals handoff at the thread1 queue
//    and the link gets rechained at jni2java_ctrl
//     so fncptr is always j2j_xchg_submit
//

typedef struct {
    lnklst           chn;      // 0x00..0x0F
    gblkfnc          fncptr;   // 0x10
    int              cmnd;     // 0x18   .
    int              p0;       // 0x1C    former dstptr
    int              p1;       // 0x20   .
    int              p2;       // 0x24    arg0
    int              p3;       // 0x28   .
    int              p4;       // 0x2C    arg1
    int              p5;       // 0x30   .
    int              p6;       // 0x34    arg2
    int*             retptr;   // 0x38
} j2j_xchg_spec;

typedef struct {
    lnklst           chn;        // 0x00..0x0F
    j2j_xchg_spec*   wrk;        // 0x10
    int              cmd;        // 0x18
    int              ret;        // 0x1C Java can provide retval
    int              j2jst;      // 0x20
    int              parm[7];    // 0x24..0x3F
                                 // parm[0-3] PC to Android
                                 // parm[4-7] Android to PC
} jni2java_ctrl;             // total size 0x40

#define PFL_SIGRES                0x8000
#define PFL_SIGRES_IO             0x80008000
#define PFL_SIG_HB                0x4000

// mask for actual signals (SIGRES and SIG_HB are reserved by the protocol)
#define PFL_SIG_USR               0x3FFF
// default .osig values on SIG_USR
#define PFL_OSIG_DEF              0x0000

// signals console line ready for pickup
#define PFL_OSIG_CNSL             0x0001
// signals ofile ready for pickup
#define PFL_OSIG_OFILE            0x0002

#define PFL_HDR_SIZE              0x40
#define PFL_TXSAFE                0x1F
// 16KB control buffers
#define PFL_BODY_SIZE             0x4000
// 256KB bulk buffers
#define PFL_BULK_SIZE             0x40000

// valid number of _RQS is 4,8,16
#define UTP_MAX_BLK_RQS           16
#define UTP_MAX_BLK_MSK           (UTP_MAX_BLK_RQS-1)
#define UTP_MAX_BLK_BND           (UTP_MAX_BLK_MSK-1)

#define UTP_MAX_BLK_BUF           0x40000
#define UTP_MAX_BLK_XFR           0x3FFFC
// this is used as an error code
//  if you read from a bulk buffer with error status
//   it returns this
#define UTP_BLK_ERROR             (UTP_MAX_BLK_BUF+1)

typedef struct {
    // direction pc2a
    int       sig_pc2a;    // 0x00
    int       pc2a_psh;    // 0x04
    int       a2pc_pll;    // 0x08
    int       pc2abpsh;    // 0x0C
    int       a2pcbpll;    // 0x10
    int       ctrlsize;    // 0x14
    int       bulksize;    // 0x18
    // spare tbd
    int       sprpc2a;     // 0x1C
    // direction a2pc
    int       sig_a2pc;    // 0x20
    int       a2pc_psh;    // 0x24
    int       pc2a_pll;    // 0x28
    int       a2pcbpsh;    // 0x2C
    int       pc2abpll;    // 0x30
    // spare tbd
    int       spra2pc[3];  // 0x34..0x3F
    // body pc2a
    //  char      pc2abody[PFL_BODY_SIZE];    // 0x0040..0x403F
    // body a2pc
    //  char      a2pcbody[PFL_BODY_SIZE];    // 0x4040..0x803F
    // bulk pc2a
    //  char      pc2abulk[PFL_BULK_SIZE];    // 0x8040..0x4803F
    // bulk a2pc
    //  char      a2pcbulk[PFL_BULK_SIZE];    // 0x48040..0x8803F
} pfl_hdr;

#define UTPST_DOWN                0
#define UTPST_RETRY               1
#define UTPST_RESET               2
#define UTPST_PINGS               3
#define UTPST_XCHG                4

// delay in milliseconds, between startup retry attempts
//  to get the device driver
#define UTP_RETRY_Z               1000
// startup heartbeat ping timeout ~1s
#define UTP_PING_ZTO              1000
// running ping timeout could be different
//  for now, it's the same ~1s
#define UTP_LOCK_ZTO              1000
// startup ping matches needed for lock
//  keep even number
#define UTP_PINGLOCK              4

// utp bulk output states
#define UTPBOST_IDLE              0
#define UTPBOST_PAYLD             1
// utp bulk input states
#define UTPBIST_IDLE              0
#define UTPBIST_PAYLD             1

typedef struct {
    int            fd;          //0x00

    u16            osig;        // 0x04
    u16            isig;        // 0x06
    u16            eosig;       // 0x08
    u16            zisig;       // 0x0A

    u16            pavail;      // 0x0C
    u16            pspace;      // 0x0E

    u32            bavail;      // 0x10
    u32            bspace;      // 0x14

    u32            spr[2];      // 0x18..0x1F

    pfl_hdr        utphdr;      // 0x20..0x5F

    u8             utpstate;    // 0x60
    u8             pings;       // 0x61
    u8             rmtres;      // 0x62 only meaningful during UTPST_XCHG
    u8             cm_state;    // 0x63 only meaningful during UTPST_XCHG

    int            timeref;     // 0x64

    int            gstcnt;      // 0x68 utp_getstatus() count
    int            pstcnt;      // 0x6C utp_putstatus() count

    u8             uhdr[4];     // 0x70 (rx u8 CMD u8 SEQ u16 SZ)
    u16            crscan;      // 0x74

    u8             bost;        // 0x76 bulk output state
    u8             bist;        // 0x77 bulk input state

    char*          datptr;      // 0x78
    u16            dlen;        // 0x80
    u8             ldvc;        // 0x81
    u8             lmempg;      // 0x82
    u32            ldva;        // 0x84

    u8             oflidx;      // 0x88  circulates 0..FF
    u8             iflidx;      // 0x89  circulates 0..FF
    u8             ocnslnum;    // 0x8A  number of console output lines
    u8             ocnslst;     // 0x8B  output console state
    u8             oflnum;      // 0x8C  number of output files on deck
    u8             oflst;       // 0x8D  output file state
    u8             iflnum;      // 0x8E  number of input files on deck
    u8             iflst;       // 0x8F  input file state <unused -- see .bist>

    lnklst         ocnslchn;    // 0x90 output console line chain
    lnklst         oflchn;      // 0xA0 output file chain
    lnklst         iflchn;      // 0xB0 input file chain

    lnklst         bochn;       // 0xC0 committed bulk output chain
    void*          oflwrk;      // 0xD0 (ofil_carrier*)
    char*          oflsrc;      // 0xD8
    u32            oflsiz;      // 0xE0

    u32            iflsiz;      // 0xE4
    void*          iflwrk;      // 0xE8 (ifil_carrier*)
    char*          ifldst;      // 0xF0

    int            tbd[66];     //0x0F8..0x1FF
} UTP_ctrl;


// the .flg field gets init 0x00
//  when the exchange gets dispatched on the link, "sent" flag gets set
//   and the exchange structure is transferred from the txchn to the
//    tachn to await ACK/response
#define FLG_uaiox_sent      0x01
// while we're processing the response,
//  first check is that response hdr is a match
#define FLG_uaiox_rhdr      0x02
// when we receive full ACK for the exchnage "resp" flag gets set
//  when the ACK is complete, the link just gets dropped from the tachn
//   so when the exchange is completed, whether or not it failed
//    all flags are set
#define FLG_uaiox_done      0x03

// every exchange gets init with .err=0
//  if the exchnage is aborted due to error, it is reflected in the .err byte
//   after the exchange (even if the exchange didn't really happen)
#define ERR_uaiox_none      0x00
#define ERR_uaiox_lnkdn     0x01
#define ERR_uaiox_unknwn    0x02
#define ERR_uaiox_to        0x03
#define ERR_uaiox_reterr    0x04
#define ERR_uaiox_setup     0x05

// the target only supports xchg layer
typedef struct {
    lnklst         chn;      // 0x00..0x0F
    u8             cmd;      // 0x10 | outbound header
    u8             seq;      // 0x11 |
    u16            len;      // 0x12 | <-- gets update for retval
    u8             flg;      // 0x14
    u8             err;      // 0x15 error code - link down, timeout
    u16            spr16;    // 0x16
    u32            spr32;    // 0x18
    u32            atrg;     // 0x1C - address target
    u64            ahst;     // 0x20 - address host, may be cast as ptr
    char           buf[16];  // 0x28..0x37 -- may be cast as anything
    int*           retptr;   // 0x38 | int pair [0] done - user inits 0
    //          - when set 1, [1] is return error code (0 means no error)
} uaio_xchg;             // total 0x40

// the comiox_ctrl structure from msc implementation is nested in FTU_ctrl (ftuptr)

// comiox needs access to some number of re-usable open-loop carriers
//  it can re-use the uaio_xchg if it's .flg is FLG_uaiox_done
//   then when it issues a transaction on it, it sets .flg=0
//    when the transaction I/O processing is done with it
//     .flg is restored to "done"

typedef struct {
    lnklst        ringchn;   // 0x00..0x0F
    uaio_xchg     carrier;   // 0x10..0x4F
} olxchg_t;              //  total 0x50

#define OLXCHG_NUM          (0x10)

// units msec between UART discovery attempts ~1s
#define FTDI_RETRY_Z              1000

// use 4KB bptrqueue
#define FTDI_BPTR_DEPTH           0x1000
#define FTDI_BPTR_MSK             (FTDI_BPTR_DEPTH-1)

// 256 byte bound on single read/write transfer
#define FTDI_XFER_MAX             0x100

// .ft_state values
#define FTUART_BOOT               0
#define FTUART_DSCVR              1
#define FTUART_PHYON              2

// comstate values
// COMDOWN is dummy state that only exists once at startup
#define COMDOWN         0
#define COMSYNC0        1
#define COMSYNC1        2
#define COMSYNC2        3
#define COMLOCK         4
#define COMXCHG         5

typedef struct {
    void*          D2xx_ptr;    // 0x00 - init 0 - java side sends ftD2xx
    u8             ft_state;    // 0x08
    u8             spr09;       // 0x09
    u16            rxvlen;      // 0x0A
    int            reftime;     // 0x0C
    bptrqueue*     rxqueue;     // 0x10
    bptrquetx*     txqueue;     // 0x18
    u8             comstate;    // 0x20
    u8             comtcnt;
    u8             comrcnt;
    u8             rxcollect;
    u32            tx_op_time;   // 0x24
    u32            rx_in_time;   // 0x28
    u8             txseq;        // 0x2C
    u8             txackseq;
    u8             rxseq;
    u8             rxackseq;
    u16            rfrshfe;      // 0x30
    u16            rfrshq0;      // 0x32
    u32            acktime;      // 0x34
    u64            spr64;        // 0x38
    //-- comiox_ctrl - start
    lnklst         cmtxchn;      // 0x40
    lnklst         cmtachn;      // 0x50
    bptrquetx*     cmtxque;      // 0x60
    bptrqueue*     cmrxque;      // 0x68
    u8             cmtseq;       // 0x70
    u8             cmtack;
    u8             cmrstate;
    u8             cmlmempg;
    u16            cmrscan;      // 0x74
    u16            cmdlen;
    u8             cmuhdr[4];    // 0x78
    u8             cmldvc;       // 0x7C
    u8             spr7D;
    u8             spr7E;
    u8             spr7F;
    char*          cmdatptr;     // 0x80
    u32            cmldva;       // 0x88
    //-- comiox_ctrl - end
    int            tbd[29];     // 0x8C..0xFF
} FTU_ctrl;

typedef struct {
    u16 red;        // channel red
    u16 green;      // channel green
    u16 blue;       // channel blue
    u16 clear;      // channel clear
    u16 infrared;   // channel infrared
    u16 spr[3];
} als;              // total 0x10

typedef struct {
    long time;          // time
    double latitude;    // latitude
    double longitude;   // longitude
    double altitude;    // altitude
    float speed;        // speed
    float bearing;      // bearing
    u32 spr[2];
} location;             // total 0x30

// use the memory variables - uartpktticks and uarttimeout
//  so these can be modified to config variables
//
// on the HP folio Windows 7, a thread timer tick is ~15.47 msec
//  this eventually may have to get tuned machine dependent
//   and be part of the .cfg file
// But for now, 15.47 msec means about 64.6 timer ticks/second
//
// so in the absence of anything else to do, our uart program
//  should pass some TX packet every second locked in COMXCHG state
//   ~1 second
//
#define UART_PKT_TICKS   (1000)
//
// every TXPKT should get an ACK within ~1.5 seconds
#define UART_ACK_TICKS   (1500)
//
// if the other side isn't talking back to us,
//  we probably have a physical cable disconnect, or the target is reset
//   OK, assume the target system gets reset,
//    it should reboot in under 5 seconds, if it doesn't, we can drop the link
//  actually, you can't die of UART_ACK_TICKS if nothing is arriving
//   a broken line doesn't fail due to UART_ACK_TICKS, rather UART_TIMEOUT
#define UART_TIMEOUT     (2000)

// units msec - this is the separation of SYNC packets when they trickle out
#define UART_SYNC_SEP    (50)

// one sub-queue is uniform size 4 KB
#define COM_SQBUFF_SIZE  0x00001000
// general guard band on all queue's
#define COM_BUFF_SAFEPAD 0x00000020
// by definition, considering the guard band
//  the maximum chunk a subque can accept in one shot
//   is the maximum number of tokens it ever issues
//    which is also the maximum payload any TXPKT can ever issue
#define COM_TXPKT_MAXPL  (COM_SQBUFF_SIZE-COM_BUFF_SAFEPAD)

// ACK packet is highest packet identifier index
#define UART_SYNC0       0x00
#define UART_SYNC1       0x01
#define UART_SYNC2       0x02
#define UART_TXPKT       0x03
#define UART_ACKPKT      0x04
// these bit fields are used to set the acceptance
//  compatability matrix based on the bit index
//   of the first header byte
//    refer to uart_rxhdr_mask[]
#define UART_SYNC0_BIT   (0x01)
#define UART_SYNC1_BIT   (0x02)
#define UART_SYNC2_BIT   (0x04)
#define UART_TXPKT_BIT   (0x08)
#define UART_ACKPKT_BIT  (0x10)

// protocol lock
//
// COMLINK heartbeat
//  while in COMXCHG state, even if nothing to report,
//   both peers should send a TXPKT at minimum rate of ~1/second
//   (in any lower state, sync packets should be generated faster than the minimum)
//
// COMLINK TIMEOUT
//  if the line is idle for ~5 seconds, drop the link
//   (On the PC side, this means the link is shut off - decayed to COMDOWN)
//     for an FPGA target board, there is no COMDOWN state,
//      and it just loops through COMSYNC0
//
// SYNC0,SYNC1,SYNC2 are all 4 byte sequences made of non-text ASCII characters
//  (so the target system could default to ASCII text, and auto-switch to
//    COMLINK on detection of SYNC0
//
// COMSYNC0 state -- trickle out SYNC0 packets at rate ~1 packet every 10-15 msec
//                    (even at 9600 BAUD, 4 byte packet fits in ~5msec)
//   wait for 2 (UART_SYNC0_RTRG) detections of SYNC0 from the other side
//    then blast 3 (UART_SYNC0_RTRG+1) SYNC0 packets and advance state to COMSYNC1
//
#define UART_SYNC0_RTRG   (2)
//
//   we may have traffic from the other side that keeps satisying TIMEOUT
//    but if we're not talking the same protocol, it's still a hopeless case
#define UART_SYNC0_DROP   (0xFA)
//      if we've sent that many SYNC0 packets, without hearing a SYNC0
//       the other side is not talking our language and we decay to COMDOWN
//
// COMSYNC1 state - "I can hear you" - and "you should be hearing me"
//                -- trickle out SYNC1 packets at rate ~1 packet every 10-15 msec
//   discard SYNC0 packets - we may have advanced state faster than other side
//                         -  but we left enough SYNC0 packets in queue
//                             that the other side should reliably detect
//   if the other side missed the SYNC0 burst, they'll never advance to SYNC1
//    while we're perpetually outputting SYNC1, so we put a cap on those
//     and decay back to SYNC0 if we hit UART_SYNC1_DROP
//
#define UART_SYNC1_DROP   (5)
//
//   it's expected, the other side will eventually join us in COMSYNC1 state
//    or we're joining the other side already in COMSYNC1 state
//     either way, we only need a single detection of a SYNC1 packet
//      then that means "I can hear you - and - you can hear me"
//   the response to that, is to advance state to COMSYNC3
//    and output a SYNC1->SYNC2 "rising edge" as two SYNC1 packets and
//                                               precisely one SYNC2
//
// COMSYNC2 state - waits on the SYNC1 -> SYNC2 rising edge
//                   so incoming SYNC0 packets are errors
//                   incoming SYNC1 packets are discarded
//                   precisely one incoming SYNC2 packet advances state to COMLOCK
//                    this is the sync one-shot
//                     at this point this side's TX(0) gets output
//                - (otherwise COMSYNC2 doesn't output anything)
//
// COMLOCK is waiting on two events and outputs directly from the poacket receiver
//   1) the arrival of the the other side's TX(0)
//       in response, it sets up the initial tokens on the front end and all subque's
//        to match the other side's TX(0) packet
//         it also issues the ACK(0) back to the other side
//   2) the arrival of ACK(0) from the other side, in response to this side's TX(0)
//
//   once those are satisfied in that order, switch state to COMXCHG
//    and the peers are connected - QCRLINK/COMLKINK is up.
//

// we won't generate any more TXPKT outputs on an excess of unanswered ACK's
//  while we're feeding 8 subque's with data, the more lead we can put on this
//   the better
//    realistically, the size of the front end buffer is usually smaller than
//     this number of TXPKT's -- so the token circulation
//      will probably limit flow rate before we hit this kind of backlog
#define UART_ACK_LIMIT    0xF0
// we won't generate a TXPKT unless there are at least ?? bytes of headway
//  on the front end output queue
//   then we'd rather preserve that buffer to allow a bigger chunk to be sent later
#define UART_TX_PKT_THR   0x40
// if the only purpose of the TXPKT is to refresh front end tokens
//  we put a bound on that
#define UART_TX_RFRSHFE   0x10

typedef struct {
    void*         shrptr;     // 0x00
    pthread_t     this_thr;   // 0x08
    int           thr_indx;   // 0X10
    volatile int  strt_flg;   // 0x14
    volatile int  stop_flg;   // 0x18
    volatile int  done_flg;   // 0x1C
    msg_queue     mqueue;     // 0x20..0x37
    // above is fixed by generic
    //------------------------------------
    // below is specific to thread n
    int           spr[18];    // 0x38..0x7F
} thread_ctrl;            // 0x80

// maximum number of threads - goes to memory allocation of thread_ctrl blocks
//  no all threads are necessarily use yet, but may be reserved for future functions
#define  MU_THREADNUM     (8)
#define  thr_ctrl         ((thread_ctrl*)(((u64)shrMEM_ptr)+0xFC00))
// actual number of working threads
//  minimum value is 1
#define  MU_THREADWRK     (5)

typedef void* (*thread_routine) (void *);

// from the generic that has to be sync'd with thread_ctrl
//  derive a specific variant for thread0 - timer thread
typedef struct {
    void*         shrptr;     // 0x00
    pthread_t     this_thr;   // 0x08
    int           thr_indx;   // 0X10
    volatile int  strt_flg;   // 0x14
    volatile int  stop_flg;   // 0x18
    volatile int  done_flg;   // 0x1C
    msg_queue     mqueue;     // 0x20..0x37
    // above is fixed by generic
    //------------------------------------
    // below is specific to thread n
    volatile int  frmtok;     // 0x38
    int           frmtref;    // 0x3C
    int           frmrate;    // 0x40 units msec
    int           rWDtim;     // 0x44
    u32           rWDset;     // 0x48
    int           spr[13];    // 0x4C..0x7F
} thread0_ctrl;            // 0x80


// from the generic that has to be sync'd with thread_ctrl
//  derive a specific variant for thread1 - camera raw receiver/dispatcher
typedef struct {
    void*         shrptr;     // 0x00
    pthread_t     this_thr;   // 0x08
    int           thr_indx;   // 0X10
    volatile int  strt_flg;   // 0x14
    volatile int  stop_flg;   // 0x18
    volatile int  done_flg;   // 0x1C
    msg_queue     mqueue;     // 0x20..0x37
    // above is fixed by generic
    //------------------------------------
    // below is specific to thread 1
    u32           snapreq;    // 0x38
    u32           snapcnt;    // 0x3C -- actually unused - can use for (SD/USB) file requests
    lnklst        cfepool;    // 0x40..0x4F
    u32           cfeicnt;    // 0x50
    u32           cfeidrop;   // 0x54
    u32           wt_texture; // 0x58 -- remnant from Tp01
    volatile int  cfedone;    // 0x5C
    lnklst        cfgpool;    // 0x60..0x6F
    u32           cfedim;     // 0x70
    // u16     cfexdim             // 0x70 lo
    // u16     cfeydim             // 0x72 hi
    u32           spr[3];     // 0x74..0x7F
} thread1_ctrl;           // 0x80

// from the generic that has to be sync'd with thread_ctrl
//  derive a specific variant for thread2 - oBitmap interface
typedef struct {
    void*         shrptr;     // 0x00
    pthread_t     this_thr;   // 0x08
    int           thr_indx;   // 0X10
    volatile int  strt_flg;   // 0x14
    volatile int  stop_flg;   // 0x18
    volatile int  done_flg;   // 0x1C
    msg_queue     mqueue;     // 0x20..0x37
    // above is fixed by generic
    //------------------------------------
    // below is specific to thread 2
    u32           imobytes;   // 0x38
    volatile int  hwsema_rdy; // 0x3C
    lnklst        imopool;    // 0x40..0x4F
    lnklst        imo_rdy;    // 0x50..0x5F
    u32           pixocnt;    // 0x60
    u32           pixodrop;   // 0x64
    u32           osnapreq;   // 0x68
    u32           ofilereq;   // 0x6C
    u32           tpflg;      // 0x70
    u32           tpmode;     // 0x74
    u32           tpxptr;     // 0x78
    u32           imodim;     // 0x7C
    // u16     imoxdim             // 0x7C lo
    // u16     imoydim             // 0x7E hi
} thread2_ctrl;            // 0x80

// from the generic that has to be sync'd with thread_ctrl
//  derive a specific variant for thread3 - HASS
typedef struct {
    void*         shrptr;     // 0x00
    pthread_t     this_thr;   // 0x08
    int           thr_indx;   // 0X10
    volatile int  strt_flg;   // 0x14
    volatile int  stop_flg;   // 0x18
    volatile int  done_flg;   // 0x1C
    msg_queue     mqueue;     // 0x20..0x37
    // above is fixed by generic
    //------------------------------------
    // below is specific to thread 3
    int           spr[18];    // 0x38..0x7F
} thread3_ctrl;            // 0x80

// from the generic that has to be sync'd with thread_ctrl
//  derive a specific variant for thread4 - pfN
typedef struct {
    void*         shrptr;     // 0x00
    pthread_t     this_thr;   // 0x08
    int           thr_indx;   // 0X10
    volatile int  strt_flg;   // 0x14
    volatile int  stop_flg;   // 0x18
    volatile int  done_flg;   // 0x1C
    msg_queue     mqueue;     // 0x20..0x37
    // above is fixed by generic
    //------------------------------------
    // below is specific to thread 4
    int           spr[18];    // 0x38..0x7F
} thread4_ctrl;            // 0x80

// from the generic that has to be sync'd with thread_ctrl
//  derive a specific variant for thread5 - worker/sequencer
typedef struct {
    void*         shrptr;     // 0x00
    pthread_t     this_thr;   // 0x08
    int           thr_indx;   // 0X10
    volatile int  strt_flg;   // 0x14
    volatile int  stop_flg;   // 0x18
    volatile int  done_flg;   // 0x1C
    msg_queue     mqueue;     // 0x20..0x37
    // above is fixed by generic
    //------------------------------------
    // below is specific to thread 5
    int           spr[18];    // 0x38..0x7F
} thread5_ctrl;            // 0x80

//------------------------------------------------------------------------------
// any setting of crash sets shutdown timer to max
#define  SHTDN_MAXTM      100
// after some delay - say 1 frame = 33 msec
//  none of the buffers should be busy any more
//   so we'll give it 1/5 frame delay to be safe
#define  SHTDN_SVM         50

// contains a justified and nested oconsole.h raw_filhdr
typedef struct {
    // a msg/gblk style header is at the start of the buffer
    lnklst       chain;       // 0x00..0x0F
    u32          spr[8];      // 0x10..0x2F
    // nested raw_filhdr (oconsole.h)
    u16          xdim;        // 0x30
    u16          ydim;        // 0x32
    u32          tstmp;       // 0x34
    u32          tdate;       // 0x38
    u8           pbpp;        // 0x3C
    u8           medge;       // 0x3D mosaic edge size - repsz
    u8           pmod;        // 0x3E pmod - could encode mosaic type
    u8           flgs;        // 0x3F flgs could be context dependent
    als          main;        // 0x40 main ALS
    als          slave;       // 0x50 slave ALS
    location     gps;         // 0x60 GPS location
    // end of header
    u16          pixels[16];  // size irrelevant, we just want the pixels pointer
    //  associated with the structure
} cfei_image;

typedef struct {
    // a msg/gblk style header is at the start of the buffer
    lnklst       chain;       // 0x00..0x0F
    u32          spr[8];      // 0x10..0x2F
    // nested raw_filhdr (oconsole.h)
    u16          xdim;        // 0x30
    u16          ydim;        // 0x32
    u32          tstmp;       // 0x34
    u32          tdate;       // 0x38
    u8           pbpp;        // 0x3C
    u8           medge;       // 0x3D mosaic edge size - repsz
    u8           pmod;        // 0x3E pmod - could encode mosaic type
    u8           flgs;        // 0x3F flgs could be context dependent
    // end of header
    void*        svmptr;   ;  // 0x40..0x47 pixels[] are indirected
} cfeg_image;

// thread 1 (control flags) at ACptr->thr1flgs
//
// substitute tst_inframe[] for sensor raw data
//  operates on get_raw_cfei()
#define  T1FLG_TSTIMG     0x00000001
// normally RAW data gets patched to display as RAW image - default 0
// when set, RAW data gets patched through the HASS GPU processing
//  of thread3
// when set, gets patched to display as RAW image
//  operates on cfe_fwrd_image()
#define  T1FLG_HASSEN     0x00000002
// this is the format of displayable output image
//  for example on ImageView - pixels are ARGB_8888
typedef struct {
    // a msg/gblk style header is at the start of the buffer
    lnklst       chain;       // 0x00..0x0F
    u32          spr[10];     // 0x10..0x37
    u32          ts_msec;     // 0x38
    // the last quad of the gblk is the dimensions
    //  so from here down, is looks like the RAW .bin file
    u16          xdim;        // 0x3C
    u16          ydim;        // 0x3E
    // end of header
    u32          pixels[16];  // size irreleval, we just want the pixels pointer
    //  associated with the structure
} pixo_image;

// image bitmap mask byte - what the thread 2 renderer is passing
// this passes nothing but fixed test patterns - say black screen
//  (they still may not be visible if we're outputting YUV)
//  (this is the startup default)
#define  IBM_MSK_NONE     0
// this passes only raw data frame
#define  IBM_MSK_RAW      1
// this passes only hass data frame
#define  IBM_MSK_HASS     2

// contains a justified and nested oconsole.h rgb_filhdr
typedef struct {
    // a msg/gblk style header is at the start of the buffer
    lnklst       chain;       // 0x00..0x0F
    u32          spr[8];      // 0x10..0x2F
    // nested rgb_filhdr (oconsole.h)
    u16          xdim;        // 0x30
    u16          ydim;        // 0x32
    u32          tstmp;       // 0x34
    u32          tdate;       // 0x38
    u8           pbpp;        // 0x3C
    u8           u8spr;       // 0x3D <tbd>
    u8           pmod;        // 0x3E pmod - could encode mosaic type
    u8           flgs;        // 0x3F flgs could be context dependent
    als          main;        // 0x40 main ALS
    als          slave;       // 0x50 slave ALS
    location     gps;         // 0x60 GPS location
    // end of header
    u32          pixels[8];   // size irrelevant, we just want the pixels pointer
    //  associated with the structure
} cofl_image;

// command states refer to cm_state
#define CMDST_HEADER     0x0000
#define CMDST_WTPAYLD    0x0001
// sanity?
#define CMDST_SANITY     0x0002
// this may appeal to another thread for completion
//  for example, it may only launch an I2C read...
#define CMDST_EXEC       0x0003
//  and this state waits on the I2C read data to arrive
//   before it can error out or dispatch it...
#define CMDST_EXEDONE    0x0004
// this is the state that actually deploys the full response...
#define CMDST_REPLY      0x0005
// ...and then loops back to the top to wait on next CMD header
// -- extensions for symmetric comiox handling
#define CMDST_WTRPAY     0x0006
#define CMDST_RZERO      0x0007

// exchange .cmd assignments
#define UAIOXCMD_WRBYTE     0x00
#define UAIOXCMD_RDBYTE     0x01
#define UAIOXCMD_WRWORD     0x02
#define UAIOXCMD_RDWORD     0x03
#define UAIOXCMD_WRQUAD     0x04
#define UAIOXCMD_RDQUAD     0x05
#define UAIOXCMD_WRLDVC     0x06
#define UAIOXCMD_RDLDVC     0x07
#define UAIOXCMD_HRTBT      0x08
#define UAIOXCMD_FNCKEY     0x09
#define UAIOXCMD_CONSOLE    0x0A
#define UAIOXCMD_OFILE      0x0B
// illegal value
#define UAIOXCMD_BOUND      0x0C
// illegal value - comiox doesn't support CONSOLE or OFILE
#define COMIOXCMD_BOUND     0x0A

// of course, this should be smaller than the subque

#define UAIOXCMD_MAXDATA    2048
#define UAIOXCMD_MAXBUFF    (UAIOXCMD_MAXDATA+16)

#define UAIOX_LDVC_BND      0x10
#define UAIOX_FK_BND        0x0020

// error list
// unused error code
#define UAERR_none          0x00000000
// unknown logical device
#define UAERR_LDVC_UNKN     0x00000001
// known device, but offline
#define UAERR_LDVC_ONLN     0x00000002
// unknown logical FNC#
#define UAERR_FNC_UNKN      0x00000003

// console line limit is 255 characters + asciiz
#define CNSL_LINE_LIM    0x100

typedef struct {
    // based on msg_gblkfnc
    lnklst       chn;                 // 0x00..0x0F
    gblkfnc      fncptr;              // 0x10
    void*        dstptr;              // 0x18
    s64          arg0;                // 0x20
    s64          arg1;                // 0x28
    s64          arg2;                // 0x30
    // doneptr used differently
    u32          spr38;               // 0x38
    u32          lenz;                // 0x3C  strlen()+1 includes asciiz
    // data field appended
    char         data[CNSL_LINE_LIM];
} cnsl_carrier;

#define CNSL_CARR_SIZE   (CNSL_LINE_LIM+64)
// won't queue past this console backlog (ocnslnum)
#define CNSL_BACKLOG     (0x80)

// ocnsl reset or idle state
#define CNSLST_IDLE      (0x00)
// ocnsl verify idle echo
#define CNSLST_IECHO     (0x01)
// ocnsl wait on message on deck to output
#define CNSLST_WTODCK    (0x02)
// ocnsl wait on message line pickup
#define CNSLST_WTLNPU    (0x03)

// won't queue past this console backlog (oflnum)
#define OFIL_BACKLOG     (0x10)

// .ofltype describes general type of transfer
// standard is block carrier like cfe_image or cofl_image
//  where the file data offset is 0x30 from refptr
#define OFLTYP_CFE       (0x0000)
#define OFLTYP_COFL      (0x0001)
// not implemented and no rules yet
//  transferring direct from the file system - no carrier buffer involved
#define OFLTYP_FS        (0x0002)

typedef struct {
    // based on msg_gblkfnc
    lnklst       chn;                 // 0x00..0x0F
    gblkfnc      fncptr;              // 0x10
    void*        dstptr;              // 0x18
    // different use model arg0...
    u16          ofltype;             // 0x20
    u8           p2;                  // 0x22
    u8           p3;                  // 0x23
    u8           p4;                  // 0x24
    u8           p5;                  // 0x25
    u8           p6;                  // 0x26
    u8           p7;                  // 0x27
    void*        refptr;              // 0x28
    u32          filsize;             // 0x30
    char         filname[12];         // 0x34..0x3F  11 char + asciiz
} ofil_carrier;

// ofl reset or idle state
#define OFILST_IDLE      (0x00)
// ofl verify idle echo
#define OFILST_IECHO     (0x01)
// ofl wait on file on deck to output
#define OFILST_WTODCK    (0x02)
// ofl wait on message file pickup
#define OFILST_WTFLPU    (0x03)

// won't queue past this console backlog (iflnum)
#define IFIL_BACKLOG     (0x10)

// .ifltype describes general type of transfer
// standard is block carrier like cfe_image or cofl_image
//  (nothing about the transfer mechanism cares what happens to the data
//    after it arrives)
// most obvious use - fill the (raw) test image buffer with a new test image
#define IFLTYP_RWTST     (0x0000)
// not implemented and no rules yet
//  transferring direct to the file system - no carrier buffer involved
#define IFLTYP_FS        (0x0001)

// ifil return status
#define IFLSTATUS_OK     0x00
#define IFLSTATUS_ERR    0x01

typedef struct {
    // based on msg_gblkfnc
    lnklst       chn;                 // 0x00..0x0F
    gblkfnc      fncptr;              // 0x10
    void*        dstptr;              // 0x18
    // different use model arg0...
    u16          ifltype;             // 0x20
    u8           p2;                  // 0x22
    u8           p3;                  // 0x23
    u8           p4;                  // 0x24
    u8           p5;                  // 0x25
    u8           p6;                  // 0x26
    u8           p7;                  // 0x27
    void*        refptr;              // 0x28
    u32          filsize;             // 0x30
    char         filname[12];         // 0x34..0x3F  11 char + asciiz
} ifil_carrier;

// rs0. ofile header for raw files (snapshot)
// pmod could encode mosaic type as RGGB, GBRG, etc...
// reserve pmod=0 as unspecified/unknown (default)
typedef struct {
    u16    xdim;    //
    u16    ydim;    //
    u32    tstmp;   // (0xFFFFFFFF invalid)
    u32    tdate;   // 0 invalid
    u8     pbpp;    // pixel - bits per pixel
    u8     medge;   // mosaic edge size - repsz
    u8     pmod;    // pmod - could encode mosaic type
    u8     flgs;    // flgs could be context dependent
    als    main;    // main ALS
    als    slave;   // slave ALS
} raw_filhdr;     // total 0x10 - 0x08 aligned

// raw size header
typedef struct {
    u16    xdim;    //
    u16    ydim;    //
} raw_sizehdr;      // total 0x04 - 0x02 aligned

// cs0. ofile header for rgb files (snapshot)
//  msbits are implicit 0's
//   if target system needs to modify transparency in ARGB context
//    that's a target adaptation operation
// each pixel occupies 3x(.pbpp) bits - msbits are 0
typedef struct {
    u16    xdim;    //
    u16    ydim;    //
    u32    tstmp;   // (0xFFFFFFFF invalid)
    u32    tdate;   // 0 invalid
    u8     pbpp;    // pixel - bits per pixel - we standardize 8 for now
    //   bit 10 bit R G B components possible down the road
    u8     u8spr;   // <tbd>
    u8     pmod;    // pmod - could encode mosaic type RGB vs BGR for example
    //   standard default format 0 is RGB
    u8     flgs;    // flgs could be context dependent - default 0
    als    main;    // main ALS
    als    slave;   // slave ALS
} rgb_filhdr;       // total 0x30 - 0x08 aligned



// error codes
// error code (-1) means wrong number of command line arguments
#define  HERROR_none      (0x0000)   // default - all OK
#define  HERROR_TOPIO     (0x0001)   // reserved - if top level has explicit files that don't open
#define  HERROR_CRASH     (0x0002)   // nothing specificc here, but crash code
//  has been set for further description
// the rest of the errors are informative, but non-fatal to the application
#define  HERROR_FILE_OP   (0x0003)   // general file IO
#define  HERROR_HIFRAME   (0x0004)   // HASS invalid input frame
#define  HERROR_HOFRAME   (0x0005)   // HASS invalid output buffer pointer
#define  HERROR_HCONFIG   (0x0006)   // HASS invalid configuration
#define  HERROR_TILEMOD   (0x0007)   // HASS invalid X,Y given tile size
#define  HERROR_FNCUNKN   (0x0008)   // HASS - not really - unknown fk() syntax
#define  HERROR_ACCEPT    (0x0009)   // HASS accept input frame to SVM

// maximum number of components
#define maxHassComp       16
#define numOfHassCh       16
#define repUnitSize       8
#define bitsPerPix        10
#define gammaTblLen       (2<<bitsPerPix)

#define H_def_WIDTH       1920
#define H_def_HEIGHT      1080

#define META_DATA_SIZE 86

typedef enum {
    LAMBDA_350,            // 0x00
    LAMBDA_360,            // 0x01
    LAMBDA_370,            // 0x02
    LAMBDA_380,            // 0x03
    LAMBDA_390,            // 0x04
    LAMBDA_400,            // 0x05
    LAMBDA_410,            // 0x06
    LAMBDA_420,            // 0x07
    LAMBDA_430,            // 0x08
    LAMBDA_440,            // 0x09
    LAMBDA_450,            // 0x0A
    LAMBDA_460,            // 0x0B
    LAMBDA_470,            // 0x0C
    LAMBDA_480,            // 0x0D
    LAMBDA_490,            // 0x0E
    LAMBDA_500,            // 0x0F
    LAMBDA_510,            // 0x10
    LAMBDA_520,            // 0x11
    LAMBDA_530,            // 0x12
    LAMBDA_540,            // 0x13
    LAMBDA_550,            // 0x14
    LAMBDA_560,            // 0x15
    LAMBDA_570,            // 0x16
    LAMBDA_580,            // 0x17
    LAMBDA_590,            // 0x18
    LAMBDA_600,            // 0x19
    LAMBDA_610,            // 0x1A
    LAMBDA_620,            // 0x1B
    LAMBDA_630,            // 0x1C
    LAMBDA_640,            // 0x1D
    LAMBDA_650,            // 0x1E
    LAMBDA_660,            // 0x1F
    LAMBDA_670,            // 0x20
    LAMBDA_680,            // 0x21
    LAMBDA_690,            // 0x22
    LAMBDA_700,            // 0x23
    LAMBDA_710,            // 0x24
    LAMBDA_720,            // 0x25
    LAMBDA_730,            // 0x26
    LAMBDA_740,            // 0x27
    LAMBDA_750,            // 0x28
    LAMBDA_760,            // 0x29
    LAMBDA_770,            // 0x2A
    LAMBDA_780,            // 0x2B
    LAMBDA_790,            // 0x2C
    LAMBDA_800,            // 0x2D
    LAMBDA_810,            // 0x2E
    LAMBDA_820,            // 0x2F
    LAMBDA_830,            // 0x30
    LAMBDA_840,            // 0x31
    LAMBDA_850,            // 0x32
    LAMBDA_860,            // 0x33
    LAMBDA_870,            // 0x34
    LAMBDA_880,            // 0x35
    LAMBDA_890,            // 0x36
    LAMBDA_900,            // 0x37
    LAMBDA_910,            // 0x38
    LAMBDA_920,            // 0x39
    LAMBDA_930,            // 0x3A
    LAMBDA_940,            // 0x3B
    LAMBDA_950,            // 0x3C
    LAMBDA_960,            // 0x3D
    LAMBDA_970,            // 0x3E
    LAMBDA_980,            // 0x3F
    LAMBDA_990,            // 0x40
    LAMBDA_1000            // 0x41
} LAMBDA_index;

//
// HASS kernel execution options
//
// ACptr->hasscaptr is low side of hassopts
#define  HSOPT_CAP_COE    (0x0001)
#define  HSOPT_CAP_GDE    (0x0002)
#define  HSOPT_CAP_SHR    (0x0004)
#define  HSOPT_CAP_NR     (0x0008)
#define  HSOPT_CAP_RCN    (0x0010)
#define  HSOPT_CAP_APP    (0x0020)
#define  HSOPT_CAP_CMB    (0x0040)
#define  HSOPT_CAP_PRC    (0x0080)
#define  HSOPT_CAP_OUT    (0x0100)
#define  HSOPT_CAP_RGB    (0x0200)
//--
#define  HSOPT_CAP_ALL    (0x03FF)
//--
// ACptr->hasstmren is high side of hassopts
#define  HSOPT_TMEAS      (0xFFFF0000)

// the number of times in the record
#define  HASS_TMR_NUM     10
//
// conceptually, this timing structure has a built in
//  msg_gblkfnc structure
//   coincidently, the structure is the size of
//
typedef struct {
    lnklst           chn;      // 0x00..0x0F
    gblkfnc          fncptr;   // 0x10
    // msg_gblkfnc emulator to this point
    //  the rest is custom starting at the .dstptr position
    //   all times are unsigned millisec
    //
    u32              tstrt;    // 0x18
    u32              tcoeptr;  // 0x1C
    u32              tguide;   // 0x20
    u32              tshrink;  // 0x24
    u32              tNR;      // 0x28
    u32              trecon;   // 0x2C
    u32              tapp;     // 0x30
    u32              tcomb;    // 0x34
    u32              tproc;    // 0x38
    u32              tout;     // 0x3C
} hass_timer;

// the thread0 version is slightly different
//  it uses it as a running total over N frames
//   so the fncptr is replaced as two integers
typedef struct {
    lnklst           chn;      // 0x00..0x0F <unused>
    u32              numfr;    // 0x10 number of frames to accumulate
    u32              frnum;    // 0x14 frame number being worked
    //---
    u32              tstrt;    // 0x18
    u32              tcoeptr;  // 0x1C
    u32              tguide;   // 0x20
    u32              tshrink;  // 0x24
    u32              tNR;      // 0x28
    u32              trecon;   // 0x2C
    u32              tapp;     // 0x30
    u32              tcomb;    // 0x34
    u32              tproc;    // 0x38
    u32              tout;     // 0x3C
} hass_tmracc;


// this is the contents of const_16colors_WN13_C11-0943_lambda500
// float lutWaveLength [66][16];

typedef float lutWaveConfig [66][numOfHassCh];

//
// lutWaveConfig lutWaveLength = {
//
//    // 350
//     {
//      (float) 8.35E-05      ,
//      (float) -0.00011294   ,
//      (float) -1.32E-05     ,
//      (float) -2.80E-05     ,
//      (float) -1.92E-05     ,
//      (float) -4.42E-05     ,
//      (float) 1.09E-05      ,
//      (float) -1.31E-05     ,
//      (float) 7.16E-05      ,
//      (float) -1.85E-05     ,
//      (float) -7.98E-05     ,
//      (float) -9.10E-05     ,
//      (float) -9.13E-05     ,
//      (float) -1.50E-05     ,
//      (float) 0.00012351    ,
//      (float) 0.00025871
//     },
//
//    // 360
//     {
//      (float) 0.00017416    ,
//      (float) -0.00021931   ,
//      (float) -1.03E-05     ,
//      (float) -5.71E-05     ,
//      (float) -2.92E-05     ,
//      (float) -6.93E-05     ,
//      (float) 4.33E-06      ,
//      (float) -2.40E-05     ,
//      (float) 0.00011817    ,
//      (float) -1.58E-06     ,
//      (float) -0.00014499   ,
//      (float) -0.00016722   ,
//      (float) -0.00017184   ,
//      (float) -3.15E-05     ,
//      (float) 0.00021349    ,
//      (float) 0.0004671
//     },
//
//    // 370
//     {
//      (float) 0.00026421    ,
//      (float) -0.00030891   ,
//      (float) 9.49E-06      ,
//      (float) -8.93E-05     ,
//      (float) -2.74E-05     ,
//      (float) -7.88E-05     ,
//      (float) -8.75E-06     ,
//      (float) -3.34E-05     ,
//      (float) 0.00013505    ,
//      (float) 3.44E-05      ,
//      (float) -0.00017238   ,
//      (float) -0.00023338   ,
//      (float) -0.00023093   ,
//      (float) -4.15E-05     ,
//      (float) 0.00026339    ,
//      (float) 0.00060385
//     },
//
//    // 380
//     {
//      (float) 0.00034447    ,
//      (float) -0.00037287   ,
//      (float) 3.62E-05      ,
//      (float) -0.00011936   ,
//      (float) -1.76E-05     ,
//      (float) -8.16E-05     ,
//      (float) -1.50E-05     ,
//      (float) -4.31E-05     ,
//      (float) 0.00013376    ,
//      (float) 5.70E-05      ,
//      (float) -0.00015984   ,
//      (float) -0.00026578   ,
//      (float) -0.00027134   ,
//      (float) -5.95E-05     ,
//      (float) 0.00027823    ,
//      (float) 0.00067934
//     },
//
//    // 390
//     {
//      (float) 0.00042117    ,
//      (float) -0.00041052   ,
//      (float) 6.17E-05      ,
//      (float) -0.00013122   ,
//      (float) -1.26E-05     ,
//      (float) -7.21E-05     ,
//      (float) -9.20E-06     ,
//      (float) -5.03E-05     ,
//      (float) 0.00010816    ,
//      (float) 6.15E-05      ,
//      (float) -0.00012242   ,
//      (float) -0.00023529   ,
//      (float) -0.00028587   ,
//      (float) -9.65E-05     ,
//      (float) 0.00026149    ,
//      (float) 0.00067812
//     },
//
//    // 400
//     {
//      (float) 0.00049358    ,
//      (float) -0.00042605   ,
//      (float) 8.76E-05      ,
//      (float) -0.000121     ,
//      (float) -1.75E-05     ,
//      (float) -5.19E-05     ,
//      (float) 2.06E-06      ,
//      (float) -4.93E-05     ,
//      (float) 8.07E-05      ,
//      (float) 4.43E-05      ,
//      (float) -9.22E-05     ,
//      (float) -0.00016961   ,
//      (float) -0.00024199   ,
//      (float) -0.00012271   ,
//      (float) 0.00020902    ,
//      (float) 0.00058815
//     },
//
//    // 410
//     {
//      (float) 0.00056882    ,
//      (float) -0.00045043   ,
//      (float) 0.00015032    ,
//      (float) -0.0001177    ,
//      (float) -1.94E-05     ,
//      (float) -2.70E-05     ,
//      (float) 1.32E-05      ,
//      (float) -4.17E-05     ,
//      (float) 4.74E-05      ,
//      (float) 2.28E-05      ,
//      (float) -5.75E-05     ,
//      (float) -8.98E-05     ,
//      (float) -0.00016344   ,
//      (float) -0.00013318   ,
//      (float) 0.00012661    ,
//      (float) 0.00043308
//     },
//
//    // 420
//     {
//      (float) 0.00063723    ,
//      (float) -0.00047388   ,
//      (float) 0.00024064    ,
//      (float) -0.00011615   ,
//      (float) -2.59E-05     ,
//      (float) 1.31E-05      ,
//      (float) 1.36E-05      ,
//      (float) -3.31E-05     ,
//      (float) 3.19E-05      ,
//      (float) -4.65E-06     ,
//      (float) -2.60E-05     ,
//      (float) -2.60E-05     ,
//      (float) -5.38E-05     ,
//      (float) -9.02E-05     ,
//      (float) 2.17E-05      ,
//      (float) 0.00020098
//     },
//
//    // 430
//     {
//      (float) 0.00065882    ,
//      (float) -0.00042457   ,
//      (float) 0.00024841    ,
//      (float) -6.08E-05     ,
//      (float) -3.59E-05     ,
//      (float) 3.86E-05      ,
//      (float) 1.61E-05      ,
//      (float) -2.66E-05     ,
//      (float) 8.43E-06      ,
//      (float) -1.06E-05     ,
//      (float) 8.40E-06      ,
//      (float) 2.90E-05      ,
//      (float) 2.81E-05      ,
//      (float) -3.78E-05     ,
//      (float) -5.29E-05     ,
//      (float) -4.33E-05
//     },
//
//    // 440
//     {
//      (float) 0.00059767    ,
//      (float) -0.00025785   ,
//      (float) 0.00011307    ,
//      (float) 7.06E-05      ,
//      (float) -5.19E-05     ,
//      (float) 2.75E-05      ,
//      (float) 2.68E-05      ,
//      (float) -1.86E-05     ,
//      (float) -2.46E-06     ,
//      (float) -1.11E-05     ,
//      (float) 2.84E-05      ,
//      (float) 5.32E-05      ,
//      (float) 8.49E-05      ,
//      (float) 1.83E-05      ,
//      (float) -9.83E-05     ,
//      (float) -0.00022887
//     },
//
//    // 450
//     {
//      (float) 0.0004586     ,
//      (float) -4.08E-06     ,
//      (float) -0.00012388   ,
//      (float) 0.00022386    ,
//      (float) -5.70E-05     ,
//      (float) -1.55E-05     ,
//      (float) 4.19E-05      ,
//      (float) -7.76E-06     ,
//      (float) -2.31E-05     ,
//      (float) 1.85E-06      ,
//      (float) 4.64E-05      ,
//      (float) 6.04E-05      ,
//      (float) 8.87E-05      ,
//      (float) 3.53E-05      ,
//      (float) -0.00010183   ,
//      (float) -0.00029473
//     },
//
//    // 460
//     {
//      (float) 0.00026866    ,
//      (float) 0.00026264    ,
//      (float) -0.00031659   ,
//      (float) 0.00027451    ,
//      (float) -9.59E-06     ,
//      (float) -6.54E-05     ,
//      (float) 3.93E-05      ,
//      (float) 8.10E-06      ,
//      (float) -2.05E-05     ,
//      (float) 2.05E-06      ,
//      (float) 5.47E-05      ,
//      (float) 4.41E-05      ,
//      (float) 8.44E-05      ,
//      (float) 4.37E-05      ,
//      (float) -9.83E-05     ,
//      (float) -0.00028939
//     },
//
//    // 470
//     {
//      (float) 6.86E-05      ,
//      (float) 0.00047258    ,
//      (float) -0.00037985   ,
//      (float) 0.00016359    ,
//      (float) 0.00010486    ,
//      (float) -0.00010601   ,
//      (float) 1.78E-05      ,
//      (float) 2.68E-05      ,
//      (float) -1.43E-05     ,
//      (float) -9.97E-07     ,
//      (float) 5.62E-05      ,
//      (float) 2.06E-05      ,
//      (float) 7.14E-05      ,
//      (float) 4.18E-05      ,
//      (float) -8.69E-05     ,
//      (float) -0.0002355
//     },
//
//    // 480
//     {
//      (float) -0.00012052   ,
//      (float) 0.00060666    ,
//      (float) -0.00033082   ,
//      (float) -4.02E-05     ,
//      (float) 0.00021445    ,
//      (float) -9.30E-05     ,
//      (float) -3.47E-05     ,
//      (float) 4.16E-05      ,
//      (float) 6.03E-06      ,
//      (float) -1.76E-05     ,
//      (float) 4.69E-05      ,
//      (float) 1.43E-05      ,
//      (float) 4.00E-05      ,
//      (float) 2.01E-05      ,
//      (float) -5.68E-05     ,
//      (float) -0.00014606
//     },
//
//    // 490
//     {
//      (float) -0.00027821   ,
//      (float) 0.00065588    ,
//      (float) -0.00020061   ,
//      (float) -0.00022881   ,
//      (float) 0.00023055    ,
//      (float) -7.42E-06     ,
//      (float) -8.80E-05     ,
//      (float) 3.10E-05      ,
//      (float) 4.30E-05      ,
//      (float) -3.30E-05     ,
//      (float) 1.69E-05      ,
//      (float) -2.60E-06     ,
//      (float) 3.55E-05      ,
//      (float) 1.64E-05      ,
//      (float) -3.44E-05     ,
//      (float) -7.50E-05
//     },
//
//    // 500
//     {
//      (float) -0.00037618   ,
//      (float) 0.00059427    ,
//      (float) -2.65E-05     ,
//      (float) -0.00032275   ,
//      (float) 0.0001173     ,
//      (float) 0.00012076    ,
//      (float) -0.00011724   ,
//      (float) -8.69E-07     ,
//      (float) 6.40E-05      ,
//      (float) -2.97E-05     ,
//      (float) -7.16E-06     ,
//      (float) -2.79E-05     ,
//      (float) 1.19E-05      ,
//      (float) 1.41E-05      ,
//      (float) 3.41E-06      ,
//      (float) 2.42E-06
//     },
//
//    // 510
//     {
//      (float) -0.00040126   ,
//      (float) 0.00043195    ,
//      (float) 0.00016375    ,
//      (float) -0.00031532   ,
//      (float) -7.19E-05     ,
//      (float) 0.00023543    ,
//      (float) -0.00010928   ,
//      (float) -4.32E-05     ,
//      (float) 5.79E-05      ,
//      (float) -2.57E-06     ,
//      (float) -2.49E-05     ,
//      (float) -4.21E-05     ,
//      (float) -2.67E-05     ,
//      (float) -2.87E-06     ,
//      (float) 5.23E-05      ,
//      (float) 7.26E-05
//     },
//
//    // 520
//     {
//      (float) -0.00036641   ,
//      (float) 0.00022287    ,
//      (float) 0.00032229    ,
//      (float) -0.00022255   ,
//      (float) -0.00025152   ,
//      (float) 0.00026195    ,
//      (float) -3.94E-05     ,
//      (float) -8.28E-05     ,
//      (float) 2.23E-05      ,
//      (float) 3.53E-05      ,
//      (float) -3.09E-05     ,
//      (float) -5.10E-05     ,
//      (float) -5.36E-05     ,
//      (float) -8.81E-06     ,
//      (float) 7.18E-05      ,
//      (float) 0.00011806
//     },
//
//    // 530
//     {
//      (float) -0.00029432   ,
//      (float) 1.77E-05      ,
//      (float) 0.00042084    ,
//      (float) -8.82E-05     ,
//      (float) -0.00034768   ,
//      (float) 0.00016529    ,
//      (float) 7.74E-05      ,
//      (float) -9.41E-05     ,
//      (float) -4.17E-05     ,
//      (float) 6.59E-05      ,
//      (float) -1.83E-05     ,
//      (float) -3.04E-05     ,
//      (float) -8.21E-05     ,
//      (float) -3.04E-05     ,
//      (float) 8.03E-05      ,
//      (float) 0.00013866
//     },
//
//    // 540
//     {
//      (float) -0.00019977   ,
//      (float) -0.00015819   ,
//      (float) 0.00044871    ,
//      (float) 6.72E-05      ,
//      (float) -0.00035346   ,
//      (float) -1.42E-05     ,
//      (float) 0.00018627    ,
//      (float) -5.77E-05     ,
//      (float) -0.00011321   ,
//      (float) 7.39E-05      ,
//      (float) 6.14E-06      ,
//      (float) 1.06E-05      ,
//      (float) -0.00010474   ,
//      (float) -5.64E-05     ,
//      (float) 7.13E-05      ,
//      (float) 0.00013819
//     },
//
//    // 550
//     {
//      (float) -0.00010004   ,
//      (float) -0.00027681   ,
//      (float) 0.00040446    ,
//      (float) 0.0002216     ,
//      (float) -0.00028926   ,
//      (float) -0.00019085   ,
//      (float) 0.00022834    ,
//      (float) 2.14E-05      ,
//      (float) -0.00016211   ,
//      (float) 5.27E-05      ,
//      (float) 2.42E-05      ,
//      (float) 4.80E-05      ,
//      (float) -8.52E-05     ,
//      (float) -5.46E-05     ,
//      (float) 2.95E-05      ,
//      (float) 9.18E-05
//     },
//
//    // 560
//     {
//      (float) -1.04E-05     ,
//      (float) -0.00033435   ,
//      (float) 0.00030974    ,
//      (float) 0.00033321    ,
//      (float) -0.00016645   ,
//      (float) -0.00030324   ,
//      (float) 0.0001732     ,
//      (float) 0.00011267    ,
//      (float) -0.00016791   ,
//      (float) 1.34E-05      ,
//      (float) 4.29E-05      ,
//      (float) 7.07E-05      ,
//      (float) -4.78E-05     ,
//      (float) -3.65E-05     ,
//      (float) -2.70E-05     ,
//      (float) 2.68E-05
//     },
//
//    // 570
//     {
//      (float) 5.65E-05      ,
//      (float) -0.00033865   ,
//      (float) 0.00017949    ,
//      (float) 0.00038221    ,
//      (float) -6.32E-06     ,
//      (float) -0.00033871   ,
//      (float) 4.41E-05      ,
//      (float) 0.00017592    ,
//      (float) -0.00011333   ,
//      (float) -3.96E-05     ,
//      (float) 5.32E-05      ,
//      (float) 8.50E-05      ,
//      (float) -2.08E-05     ,
//      (float) -3.81E-05     ,
//      (float) -5.16E-05     ,
//      (float) -1.47E-05
//     },
//
//    // 580
//     {
//      (float) 9.54E-05      ,
//      (float) -0.00030233   ,
//      (float) 4.63E-05      ,
//      (float) 0.00035996    ,
//      (float) 0.00016289    ,
//      (float) -0.00030875   ,
//      (float) -0.00010602   ,
//      (float) 0.00019062    ,
//      (float) -7.01E-06     ,
//      (float) -9.09E-05     ,
//      (float) 3.06E-05      ,
//      (float) 8.48E-05      ,
//      (float) 6.52E-06      ,
//      (float) -3.54E-05     ,
//      (float) -6.27E-05     ,
//      (float) -2.77E-05
//     },
//
//    // 590
//     {
//      (float) 0.00011107    ,
//      (float) -0.0002441    ,
//      (float) -6.53E-05     ,
//      (float) 0.00028938    ,
//      (float) 0.00030158    ,
//      (float) -0.00022922   ,
//      (float) -0.00023127   ,
//      (float) 0.00015709    ,
//      (float) 0.0001228     ,
//      (float) -0.00012972   ,
//      (float) -2.00E-05     ,
//      (float) 5.36E-05      ,
//      (float) 5.15E-05      ,
//      (float) -8.58E-06     ,
//      (float) -6.80E-05     ,
//      (float) -3.75E-05
//     },
//
//    // 600
//     {
//      (float) 0.000112      ,
//      (float) -0.00017614   ,
//      (float) -0.0001524    ,
//      (float) 0.00020266    ,
//      (float) 0.000382      ,
//      (float) -0.00010924   ,
//      (float) -0.00029963   ,
//      (float) 6.73E-05      ,
//      (float) 0.00023228    ,
//      (float) -0.00012471   ,
//      (float) -7.21E-05     ,
//      (float) -4.85E-06     ,
//      (float) 8.90E-05      ,
//      (float) 3.74E-05      ,
//      (float) -5.88E-05     ,
//      (float) -5.67E-05
//     },
//
//    // 610
//     {
//      (float) 0.00010255    ,
//      (float) -0.00010401   ,
//      (float) -0.00022155   ,
//      (float) 0.00011003    ,
//      (float) 0.0004095     ,
//      (float) 2.68E-05      ,
//      (float) -0.00030487   ,
//      (float) -5.29E-05     ,
//      (float) 0.00026563    ,
//      (float) -5.75E-05     ,
//      (float) -9.59E-05     ,
//      (float) -6.86E-05     ,
//      (float) 9.17E-05      ,
//      (float) 4.86E-05      ,
//      (float) -1.91E-05     ,
//      (float) -5.19E-05
//     },
//
//    // 620
//     {
//      (float) 8.90E-05      ,
//      (float) -3.01E-05     ,
//      (float) -0.00026119   ,
//      (float) 9.68E-06      ,
//      (float) 0.0003936     ,
//      (float) 0.00016693    ,
//      (float) -0.00024827   ,
//      (float) -0.0001742    ,
//      (float) 0.00020451    ,
//      (float) 5.15E-05      ,
//      (float) -8.41E-05     ,
//      (float) -0.00010378   ,
//      (float) 6.68E-05      ,
//      (float) 2.76E-05      ,
//      (float) 2.06E-05      ,
//      (float) -4.06E-05
//     },
//
//    // 630
//     {
//      (float) 7.23E-05      ,
//      (float) 4.11E-05      ,
//      (float) -0.00026775   ,
//      (float) -8.59E-05     ,
//      (float) 0.00032816    ,
//      (float) 0.00029992    ,
//      (float) -0.00013694   ,
//      (float) -0.00027039   ,
//      (float) 7.08E-05      ,
//      (float) 0.00016053    ,
//      (float) -4.43E-05     ,
//      (float) -0.00010957   ,
//      (float) 3.13E-05      ,
//      (float) 9.00E-06      ,
//      (float) 3.51E-05      ,
//      (float) -3.72E-05
//     },
//
//    // 640
//     {
//      (float) 5.13E-05      ,
//      (float) 0.00010245    ,
//      (float) -0.00024074   ,
//      (float) -0.00016263   ,
//      (float) 0.00021675    ,
//      (float) 0.00040276    ,
//      (float) 6.05E-06      ,
//      (float) -0.00030797   ,
//      (float) -8.27E-05     ,
//      (float) 0.00020528    ,
//      (float) 1.08E-05      ,
//      (float) -8.19E-05     ,
//      (float) 1.52E-06      ,
//      (float) 4.35E-06      ,
//      (float) 3.29E-05      ,
//      (float) -5.74E-05
//     },
//
//    // 650
//     {
//      (float) 2.49E-05      ,
//      (float) 0.00014988    ,
//      (float) -0.00018869   ,
//      (float) -0.00021089   ,
//      (float) 8.30E-05      ,
//      (float) 0.00044546    ,
//      (float) 0.00016469    ,
//      (float) -0.00028489   ,
//      (float) -0.00020895   ,
//      (float) 0.00016503    ,
//      (float) 7.32E-05      ,
//      (float) -2.50E-05     ,
//      (float) -2.58E-05     ,
//      (float) 1.64E-05      ,
//      (float) 3.92E-06      ,
//      (float) -8.14E-05
//     },
//
//    // 660
//     {
//      (float) -1.08E-05     ,
//      (float) 0.00018028    ,
//      (float) -0.00012607   ,
//      (float) -0.00022984   ,
//      (float) -5.39E-05     ,
//      (float) 0.00041633    ,
//      (float) 0.00030935    ,
//      (float) -0.00019767   ,
//      (float) -0.00027551   ,
//      (float) 4.47E-05      ,
//      (float) 0.00011608    ,
//      (float) 3.88E-05      ,
//      (float) -4.03E-05     ,
//      (float) 2.27E-05      ,
//      (float) -1.32E-05     ,
//      (float) -9.00E-05
//     },
//
//    // 670
//     {
//      (float) -5.44E-05     ,
//      (float) 0.00019696    ,
//      (float) -6.59E-05     ,
//      (float) -0.00021939   ,
//      (float) -0.00017514   ,
//      (float) 0.00031866    ,
//      (float) 0.00041779    ,
//      (float) -5.46E-05     ,
//      (float) -0.0002879    ,
//      (float) -0.00010143   ,
//      (float) 0.00011433    ,
//      (float) 8.63E-05      ,
//      (float) -3.13E-05     ,
//      (float) 1.66E-05      ,
//      (float) -1.74E-05     ,
//      (float) -7.23E-05
//     },
//
//    // 680
//     {
//      (float) -0.00010099   ,
//      (float) 0.00020525    ,
//      (float) -1.28E-05     ,
//      (float) -0.00018574   ,
//      (float) -0.00026246   ,
//      (float) 0.00017404    ,
//      (float) 0.00046593    ,
//      (float) 0.00012887    ,
//      (float) -0.00025351   ,
//      (float) -0.00022591   ,
//      (float) 6.10E-05      ,
//      (float) 0.00010539    ,
//      (float) -4.14E-06     ,
//      (float) 1.73E-05      ,
//      (float) -1.90E-05     ,
//      (float) -4.89E-05
//     },
//
//    // 690
//     {
//      (float) -0.00014473   ,
//      (float) 0.00020722    ,
//      (float) 3.35E-05      ,
//      (float) -0.00013683   ,
//      (float) -0.00031093   ,
//      (float) 2.32E-05      ,
//      (float) 0.00044215    ,
//      (float) 0.00031108    ,
//      (float) -0.00018055   ,
//      (float) -0.00029103   ,
//      (float) -1.77E-05     ,
//      (float) 8.59E-05      ,
//      (float) 2.82E-05      ,
//      (float) 2.48E-05      ,
//      (float) -2.46E-05     ,
//      (float) -3.30E-05
//     },
//
//    // 700
//     {
//      (float) -0.00018147   ,
//      (float) 0.00020381    ,
//      (float) 7.53E-05      ,
//      (float) -8.24E-05     ,
//      (float) -0.00032061   ,
//      (float) -0.00010361   ,
//      (float) 0.00035458    ,
//      (float) 0.00045004    ,
//      (float) -7.25E-05     ,
//      (float) -0.00028525   ,
//      (float) -9.58E-05     ,
//      (float) 3.66E-05      ,
//      (float) 5.26E-05      ,
//      (float) 3.01E-05      ,
//      (float) -3.48E-05     ,
//      (float) -3.39E-05
//     },
//
//    // 710
//     {
//      (float) -0.00020884   ,
//      (float) 0.0001943     ,
//      (float) 0.00011546    ,
//      (float) -3.26E-05     ,
//      (float) -0.00029467   ,
//      (float) -0.0001912    ,
//      (float) 0.00021894    ,
//      (float) 0.00052404    ,
//      (float) 6.55E-05      ,
//      (float) -0.00022186   ,
//      (float) -0.00015422   ,
//      (float) -2.36E-05     ,
//      (float) 5.84E-05      ,
//      (float) 2.33E-05      ,
//      (float) -4.53E-05     ,
//      (float) -5.34E-05
//     },
//
//    // 720
//     {
//      (float) -0.00022693   ,
//      (float) 0.00017761    ,
//      (float) 0.00015005    ,
//      (float) 9.84E-06      ,
//      (float) -0.00024492   ,
//      (float) -0.00023498   ,
//      (float) 6.12E-05      ,
//      (float) 0.00052175    ,
//      (float) 0.00021945    ,
//      (float) -0.00011796   ,
//      (float) -0.00017953   ,
//      (float) -8.46E-05     ,
//      (float) 4.12E-05      ,
//      (float) -1.30E-07     ,
//      (float) -5.92E-05     ,
//      (float) -7.05E-05
//     },
//
//    // 730
//     {
//      (float) -0.00023349   ,
//      (float) 0.00015485    ,
//      (float) 0.0001752     ,
//      (float) 4.47E-05      ,
//      (float) -0.00018038   ,
//      (float) -0.00024193   ,
//      (float) -8.20E-05     ,
//      (float) 0.00044097    ,
//      (float) 0.00034984    ,
//      (float) 2.74E-05      ,
//      (float) -0.00015867   ,
//      (float) -0.0001361    ,
//      (float) -4.56E-06     ,
//      (float) -4.20E-05     ,
//      (float) -7.30E-05     ,
//      (float) -8.33E-05
//     },
//
//    // 740
//     {
//      (float) -0.00022753   ,
//      (float) 0.00012927    ,
//      (float) 0.00018578    ,
//      (float) 7.37E-05      ,
//      (float) -0.0001115    ,
//      (float) -0.00022232   ,
//      (float) -0.0001872    ,
//      (float) 0.00030915    ,
//      (float) 0.00042597    ,
//      (float) 0.00017746    ,
//      (float) -7.99E-05     ,
//      (float) -0.0001565    ,
//      (float) -7.58E-05     ,
//      (float) -0.0001011    ,
//      (float) -8.27E-05     ,
//      (float) -9.66E-05
//     },
//
//    // 750
//     {
//      (float) -0.00021082   ,
//      (float) 0.00010412    ,
//      (float) 0.00018338    ,
//      (float) 9.65E-05      ,
//      (float) -4.57E-05     ,
//      (float) -0.00018689   ,
//      (float) -0.00024998   ,
//      (float) 0.00015939    ,
//      (float) 0.00043308    ,
//      (float) 0.00032855    ,
//      (float) 2.55E-05      ,
//      (float) -0.00014868   ,
//      (float) -0.00014451   ,
//      (float) -0.00016539   ,
//      (float) -9.09E-05     ,
//      (float) -0.0001192
//     },
//
//    // 760
//     {
//      (float) -0.00018696   ,
//      (float) 7.98E-05      ,
//      (float) 0.0001724     ,
//      (float) 0.00010987    ,
//      (float) 1.50E-05      ,
//      (float) -0.00014212   ,
//      (float) -0.00027988   ,
//      (float) 1.45E-05      ,
//      (float) 0.00039022    ,
//      (float) 0.00045335    ,
//      (float) 0.00014322    ,
//      (float) -0.00011548   ,
//      (float) -0.00020194   ,
//      (float) -0.00021956   ,
//      (float) -9.92E-05     ,
//      (float) -0.00015327
//     },
//
//    // 770
//     {
//      (float) -0.00016111   ,
//      (float) 5.57E-05      ,
//      (float) 0.00015189    ,
//      (float) 0.00011466    ,
//      (float) 6.59E-05      ,
//      (float) -9.45E-05     ,
//      (float) -0.00028486   ,
//      (float) -0.00011497   ,
//      (float) 0.00032522    ,
//      (float) 0.00053491    ,
//      (float) 0.00024616    ,
//      (float) -5.68E-05     ,
//      (float) -0.00024238   ,
//      (float) -0.00025973   ,
//      (float) -0.0001169    ,
//      (float) -0.00017188
//     },
//
//    // 780
//     {
//      (float) -0.00013719   ,
//      (float) 3.08E-05      ,
//      (float) 0.00012244    ,
//      (float) 0.0001122     ,
//      (float) 0.00010311    ,
//      (float) -5.07E-05     ,
//      (float) -0.0002723    ,
//      (float) -0.00021559   ,
//      (float) 0.00025227    ,
//      (float) 0.00056439    ,
//      (float) 0.00032177    ,
//      (float) 6.53E-06      ,
//      (float) -0.00025144   ,
//      (float) -0.0002825    ,
//      (float) -0.00012933   ,
//      (float) -0.0001749
//     },
//
//    // 790
//     {
//      (float) -0.0001174    ,
//      (float) 4.36E-06      ,
//      (float) 8.35E-05      ,
//      (float) 0.00010468    ,
//      (float) 0.00012565    ,
//      (float) -1.91E-05     ,
//      (float) -0.00023888   ,
//      (float) -0.00028608   ,
//      (float) 0.00017774    ,
//      (float) 0.00053588    ,
//      (float) 0.00037568    ,
//      (float) 6.71E-05      ,
//      (float) -0.00023436   ,
//      (float) -0.00029123   ,
//      (float) -0.00012781   ,
//      (float) -0.00015634
//     },
//
//    // 800
//     {
//      (float) -0.00010331   ,
//      (float) -2.28E-05     ,
//      (float) 4.03E-05      ,
//      (float) 9.25E-05      ,
//      (float) 0.00013653    ,
//      (float) -7.85E-07     ,
//      (float) -0.0001938    ,
//      (float) -0.00033367   ,
//      (float) 0.00011872    ,
//      (float) 0.0004713     ,
//      (float) 0.00039017    ,
//      (float) 0.0001206     ,
//      (float) -0.0001959    ,
//      (float) -0.00028526   ,
//      (float) -0.00011785   ,
//      (float) -0.00011448
//     },
//
//    // 810
//     {
//      (float) -9.54E-05     ,
//      (float) -5.17E-05     ,
//      (float) -5.30E-06     ,
//      (float) 7.43E-05      ,
//      (float) 0.00013357    ,
//      (float) 7.74E-06      ,
//      (float) -0.00015365   ,
//      (float) -0.00033853   ,
//      (float) 7.58E-05      ,
//      (float) 0.00037175    ,
//      (float) 0.00034756    ,
//      (float) 0.00016037    ,
//      (float) -0.00013155   ,
//      (float) -0.00025106   ,
//      (float) -8.91E-05     ,
//      (float) -6.02E-05
//     },
//
//    // 820
//     {
//      (float) -8.83E-05     ,
//      (float) -7.86E-05     ,
//      (float) -5.17E-05     ,
//      (float) 5.57E-05      ,
//      (float) 0.00012418    ,
//      (float) 5.79E-06      ,
//      (float) -0.0001038    ,
//      (float) -0.00032146   ,
//      (float) 2.75E-05      ,
//      (float) 0.0002567     ,
//      (float) 0.00028849    ,
//      (float) 0.00019938    ,
//      (float) -5.91E-05     ,
//      (float) -0.0002018    ,
//      (float) -6.57E-05     ,
//      (float) -1.41E-06
//     },
//
//    // 830
//     {
//      (float) -7.89E-05     ,
//      (float) -0.00010037   ,
//      (float) -8.78E-05     ,
//      (float) 3.83E-05      ,
//      (float) 0.00011681    ,
//      (float) 1.25E-05      ,
//      (float) -6.83E-05     ,
//      (float) -0.00030253   ,
//      (float) -1.80E-05     ,
//      (float) 0.00016624    ,
//      (float) 0.00023401    ,
//      (float) 0.00022636    ,
//      (float) 3.12E-07      ,
//      (float) -0.00013033   ,
//      (float) -5.71E-05     ,
//      (float) 2.93E-05
//     },
//
//    // 840
//     {
//      (float) -7.32E-05     ,
//      (float) -0.00012121   ,
//      (float) -0.00012296   ,
//      (float) 1.94E-05      ,
//      (float) 0.00010085    ,
//      (float) 1.27E-05      ,
//      (float) -3.66E-05     ,
//      (float) -0.00025774   ,
//      (float) -5.19E-05     ,
//      (float) 6.03E-05      ,
//      (float) 0.00015006    ,
//      (float) 0.0002392     ,
//      (float) 6.14E-05      ,
//      (float) -2.56E-05     ,
//      (float) -3.36E-05     ,
//      (float) 5.07E-05
//     },
//
//    // 850
//     {
//      (float) -5.82E-05     ,
//      (float) -0.0001325    ,
//      (float) -0.00014597   ,
//      (float) 3.95E-06      ,
//      (float) 9.43E-05      ,
//      (float) 2.46E-05      ,
//      (float) -2.73E-06     ,
//      (float) -0.00022544   ,
//      (float) -0.00010659   ,
//      (float) -3.00E-05     ,
//      (float) 0.00011427    ,
//      (float) 0.0002768     ,
//      (float) 0.00012171    ,
//      (float) 5.24E-05      ,
//      (float) -4.74E-05     ,
//      (float) 3.35E-05
//     },
//
//    // 860
//     {
//      (float) -4.90E-05     ,
//      (float) -0.00014545   ,
//      (float) -0.00016856   ,
//      (float) -1.09E-05     ,
//      (float) 8.09E-05      ,
//      (float) 3.43E-05      ,
//      (float) 1.19E-05      ,
//      (float) -0.00017778   ,
//      (float) -0.00014303   ,
//      (float) -0.00010971   ,
//      (float) 6.05E-05      ,
//      (float) 0.00027807    ,
//      (float) 0.00016791    ,
//      (float) 0.00014425    ,
//      (float) -3.49E-05     ,
//      (float) 3.06E-05
//     },
//
//    // 870
//     {
//      (float) -3.75E-05     ,
//      (float) -0.00015322   ,
//      (float) -0.00018643   ,
//      (float) -2.37E-05     ,
//      (float) 6.85E-05      ,
//      (float) 3.74E-05      ,
//      (float) 4.21E-05      ,
//      (float) -0.00013164   ,
//      (float) -0.00018803   ,
//      (float) -0.00019107   ,
//      (float) 1.72E-05      ,
//      (float) 0.000287      ,
//      (float) 0.00023087    ,
//      (float) 0.00021679    ,
//      (float) -2.76E-05     ,
//      (float) 7.81E-06
//     },
//
//    // 880
//     {
//      (float) -3.09E-05     ,
//      (float) -0.00016222   ,
//      (float) -0.00020071   ,
//      (float) -3.50E-05     ,
//      (float) 5.25E-05      ,
//      (float) 4.44E-05      ,
//      (float) 4.30E-05      ,
//      (float) -7.61E-05     ,
//      (float) -0.00021367   ,
//      (float) -0.00024868   ,
//      (float) -3.04E-05     ,
//      (float) 0.00025351    ,
//      (float) 0.00027473    ,
//      (float) 0.00029394    ,
//      (float) 1.56E-06      ,
//      (float) -1.61E-06
//     },
//
//    // 890
//     {
//      (float) -2.64E-05     ,
//      (float) -0.00016895   ,
//      (float) -0.00021624   ,
//      (float) -4.40E-05     ,
//      (float) 3.29E-05      ,
//      (float) 3.50E-05      ,
//      (float) 6.69E-05      ,
//      (float) -2.05E-05     ,
//      (float) -0.00024509   ,
//      (float) -0.00030765   ,
//      (float) -8.33E-05     ,
//      (float) 0.00021396    ,
//      (float) 0.00033142    ,
//      (float) 0.0003614     ,
//      (float) 3.91E-05      ,
//      (float) -9.66E-06
//     },
//
//    // 900
//     {
//      (float) -2.42E-05     ,
//      (float) -0.00017557   ,
//      (float) -0.00022736   ,
//      (float) -5.01E-05     ,
//      (float) 1.48E-05      ,
//      (float) 3.45E-05      ,
//      (float) 5.72E-05      ,
//      (float) 3.66E-05      ,
//      (float) -0.00026276   ,
//      (float) -0.00033563   ,
//      (float) -0.00012087   ,
//      (float) 0.00014795    ,
//      (float) 0.00035653    ,
//      (float) 0.00041109    ,
//      (float) 9.00E-05      ,
//      (float) 1.80E-07
//     },
//
//    // 910
//     {
//      (float) -2.36E-05     ,
//      (float) -0.00017873   ,
//      (float) -0.00023846   ,
//      (float) -5.54E-05     ,
//      (float) -5.26E-06     ,
//      (float) 1.91E-05      ,
//      (float) 7.27E-05      ,
//      (float) 9.00E-05      ,
//      (float) -0.00028249   ,
//      (float) -0.00036914   ,
//      (float) -0.0001687    ,
//      (float) 9.07E-05      ,
//      (float) 0.00039333    ,
//      (float) 0.00045169    ,
//      (float) 0.00014194    ,
//      (float) 7.90E-06
//     },
//
//    // 920
//     {
//      (float) -2.52E-05     ,
//      (float) -0.00018209   ,
//      (float) -0.00024679   ,
//      (float) -5.68E-05     ,
//      (float) -2.31E-05     ,
//      (float) 1.20E-05      ,
//      (float) 5.88E-05      ,
//      (float) 0.00013828    ,
//      (float) -0.00028852   ,
//      (float) -0.00037475   ,
//      (float) -0.00019222   ,
//      (float) 1.45E-05      ,
//      (float) 0.00038608    ,
//      (float) 0.00047528    ,
//      (float) 0.00019965    ,
//      (float) 4.28E-05
//     },
//
//    // 930
//     {
//      (float) -2.57E-05     ,
//      (float) -0.00017957   ,
//      (float) -0.00024945   ,
//      (float) -5.79E-05     ,
//      (float) -4.09E-05     ,
//      (float) -2.78E-06     ,
//      (float) 6.94E-05      ,
//      (float) 0.00017537    ,
//      (float) -0.00029191   ,
//      (float) -0.00038642   ,
//      (float) -0.00022623   ,
//      (float) -3.42E-05     ,
//      (float) 0.00039807    ,
//      (float) 0.00048282    ,
//      (float) 0.00024262    ,
//      (float) 6.01E-05
//     },
//
//    // 940
//     {
//      (float) -3.03E-05     ,
//      (float) -0.0001785    ,
//      (float) -0.00025305   ,
//      (float) -5.57E-05     ,
//      (float) -5.86E-05     ,
//      (float) -1.46E-05     ,
//      (float) 5.67E-05      ,
//      (float) 0.00020873    ,
//      (float) -0.00027734   ,
//      (float) -0.0003827    ,
//      (float) -0.00024439   ,
//      (float) -9.51E-05     ,
//      (float) 0.00036299    ,
//      (float) 0.00047463    ,
//      (float) 0.0003012     ,
//      (float) 0.00011175
//     },
//
//    // 950
//     {
//      (float) -2.77E-05     ,
//      (float) -0.00016608   ,
//      (float) -0.00023866   ,
//      (float) -5.29E-05     ,
//      (float) -6.57E-05     ,
//      (float) -2.13E-05     ,
//      (float) 6.07E-05      ,
//      (float) 0.00021603    ,
//      (float) -0.00025811   ,
//      (float) -0.0003758    ,
//      (float) -0.000247     ,
//      (float) -0.00010581   ,
//      (float) 0.00034645    ,
//      (float) 0.00044054    ,
//      (float) 0.00031294    ,
//      (float) 0.00011081
//     },
//
//    // 960
//     {
//      (float) -3.17E-05     ,
//      (float) -0.00015555   ,
//      (float) -0.00022589   ,
//      (float) -4.79E-05     ,
//      (float) -7.49E-05     ,
//      (float) -3.40E-05     ,
//      (float) 5.35E-05      ,
//      (float) 0.00021988    ,
//      (float) -0.00021702   ,
//      (float) -0.00035622   ,
//      (float) -0.00025337   ,
//      (float) -0.00013527   ,
//      (float) 0.00029386    ,
//      (float) 0.00040672    ,
//      (float) 0.0003419     ,
//      (float) 0.00014253
//     },
//
//    // 970
//     {
//      (float) -2.42E-05     ,
//      (float) -0.00013134   ,
//      (float) -0.00019104   ,
//      (float) -4.19E-05     ,
//      (float) -6.70E-05     ,
//      (float) -2.59E-05     ,
//      (float) 4.36E-05      ,
//      (float) 0.00019674    ,
//      (float) -0.00018208   ,
//      (float) -0.00031773   ,
//      (float) -0.00021956   ,
//      (float) -0.00010997   ,
//      (float) 0.00025291    ,
//      (float) 0.00034089    ,
//      (float) 0.00029964    ,
//      (float) 0.00011537
//     },
//
//    // 980
//     {
//      (float) -2.23E-05     ,
//      (float) -0.00010657   ,
//      (float) -0.00015557   ,
//      (float) -3.37E-05     ,
//      (float) -6.08E-05     ,
//      (float) -3.04E-05     ,
//      (float) 3.90E-05      ,
//      (float) 0.00016758    ,
//      (float) -0.0001367    ,
//      (float) -0.00025982   ,
//      (float) -0.0001957    ,
//      (float) -0.00010466   ,
//      (float) 0.00019676    ,
//      (float) 0.00027984    ,
//      (float) 0.00026437    ,
//      (float) 0.00010588
//     },
//
//    // 990
//     {
//      (float) -1.68E-05     ,
//      (float) -7.74E-05     ,
//      (float) -0.00011301   ,
//      (float) -2.41E-05     ,
//      (float) -4.67E-05     ,
//      (float) -2.10E-05     ,
//      (float) 1.75E-05      ,
//      (float) 0.00012937    ,
//      (float) -9.17E-05     ,
//      (float) -0.00018756   ,
//      (float) -0.00014492   ,
//      (float) -8.22E-05     ,
//      (float) 0.00012836    ,
//      (float) 0.0001961     ,
//      (float) 0.00020082    ,
//      (float) 9.36E-05
//     },
//
//    // 1000
//     {
//      (float) -7.85E-06     ,
//      (float) -3.94E-05     ,
//      (float) -5.73E-05     ,
//      (float) -1.32E-05     ,
//      (float) -2.50E-05     ,
//      (float) -1.02E-05     ,
//      (float) 1.01E-05      ,
//      (float) 7.00E-05      ,
//      (float) -4.81E-05     ,
//      (float) -9.99E-05     ,
//      (float) -8.00E-05     ,
//      (float) -4.04E-05     ,
//      (float) 7.29E-05      ,
//      (float) 0.00010326    ,
//      (float) 0.00010377    ,
//      (float) 4.12E-05
//     }
//    };
//



lutWaveConfig lutWaveLength = {

        // 350
        {
                (float) 0.536333632   ,
                (float) -0.145395237  ,
                (float) -0.036944691  ,
                (float) 0.013983367   ,
                (float) 9.53E-06      ,
                (float) 0.006554703   ,
                (float) 0.027847558   ,
                (float) -0.028205087  ,
                (float) 0.027092774   ,
                (float) -0.002534485  ,
                (float) 0.015492935   ,
                (float) -0.016843601  ,
                (float) -0.005680743  ,
                (float) -0.007269762  ,
                (float) -0.054821155  ,
                (float) -0.006872507
        },

        // 360
        {
                (float) 1.072587814   ,
                (float) -2.90E-01     ,
                (float) -7.39E-02     ,
                (float) 2.80E-02      ,
                (float) 2.07E-05      ,
                (float) 1.31E-02      ,
                (float) 5.56E-02      ,
                (float) -5.64E-02     ,
                (float) 5.40E-02      ,
                (float) -5.08E-03     ,
                (float) 3.10E-02      ,
                (float) -3.36E-02     ,
                (float) -1.14E-02     ,
                (float) -1.46E-02     ,
                (float) -1.09E-01     ,
                (float) -1.37E-02
        },

        // 370
        {
                (float) 1.608683093   ,
                (float) -4.36E-01     ,
                (float) -1.11E-01     ,
                (float) 4.21E-02      ,
                (float) 4.69E-05      ,
                (float) 1.96E-02      ,
                (float) 8.34E-02      ,
                (float) -8.46E-02     ,
                (float) 8.10E-02      ,
                (float) -7.55E-03     ,
                (float) 4.65E-02      ,
                (float) -5.05E-02     ,
                (float) -1.70E-02     ,
                (float) -2.20E-02     ,
                (float) -1.64E-01     ,
                (float) -2.05E-02
        },

        // 380
        {
                (float) 2.142116766   ,
                (float) -0.579594674  ,
                (float) -1.48E-01     ,
                (float) 5.60E-02      ,
                (float) 2.65E-04      ,
                (float) 2.59E-02      ,
                (float) 1.11E-01      ,
                (float) -1.12E-01     ,
                (float) 1.06E-01      ,
                (float) -1.05E-02     ,
                (float) 6.32E-02      ,
                (float) -6.55E-02     ,
                (float) -2.19E-02     ,
                (float) -3.01E-02     ,
                (float) -2.19E-01     ,
                (float) -2.78E-02
        },

        // 390
        {
                (float) 2.663831424   ,
                (float) -0.720063952  ,
                (float) -1.84E-01     ,
                (float) 7.23E-02      ,
                (float) 3.42E-04      ,
                (float) 3.07E-02      ,
                (float) 1.41E-01      ,
                (float) -1.39E-01     ,
                (float) 1.22E-01      ,
                (float) -2.05E-02     ,
                (float) 7.95E-02      ,
                (float) -6.91E-02     ,
                (float) -1.60E-02     ,
                (float) -3.66E-02     ,
                (float) -2.74E-01     ,
                (float) -4.29E-02
        },

        // 400
        {
                (float) 3.158691661   ,
                (float) -0.848893666  ,
                (float) -2.28E-01     ,
                (float) 9.85E-02      ,
                (float) -7.27E-05     ,
                (float) 2.87E-02      ,
                (float) 1.70E-01      ,
                (float) -1.57E-01     ,
                (float) 1.24E-01      ,
                (float) -4.49E-02     ,
                (float) 8.26E-02      ,
                (float) -5.88E-02     ,
                (float) 9.85E-03      ,
                (float) -3.10E-02     ,
                (float) -3.20E-01     ,
                (float) -7.43E-02
        },

        // 410
        {
                (float) 3.622486576   ,
                (float) -0.979709654  ,
                (float) -2.63E-01     ,
                (float) 1.31E-01      ,
                (float) -2.49E-03     ,
                (float) 1.79E-02      ,
                (float) 1.92E-01      ,
                (float) -1.61E-01     ,
                (float) 1.15E-01      ,
                (float) -8.06E-02     ,
                (float) 7.03E-02      ,
                (float) -4.81E-02     ,
                (float) 5.08E-02      ,
                (float) -8.06E-03     ,
                (float) -3.45E-01     ,
                (float) -1.20E-01
        },

        // 420
        {
                (float) 4.037697237   ,
                (float) -1.097416235  ,
                (float) -2.94E-01     ,
                (float) 1.78E-01      ,
                (float) -8.02E-03     ,
                (float) -2.18E-03     ,
                (float) 2.05E-01      ,
                (float) -1.52E-01     ,
                (float) 1.06E-01      ,
                (float) -1.20E-01     ,
                (float) 4.09E-02      ,
                (float) -4.85E-02     ,
                (float) 9.26E-02      ,
                (float) 2.51E-02      ,
                (float) -3.40E-01     ,
                (float) -1.72E-01
        },

        // 430
        {
                (float) 4.344775155   ,
                (float) -1.114736542  ,
                (float) -3.76E-01     ,
                (float) 2.40E-01      ,
                (float) 4.33E-03      ,
                (float) -3.69E-02     ,
                (float) 2.06E-01      ,
                (float) -1.26E-01     ,
                (float) 1.05E-01      ,
                (float) -1.41E-01     ,
                (float) -1.42E-03     ,
                (float) -6.20E-02     ,
                (float) 1.06E-01      ,
                (float) 5.44E-02      ,
                (float) -3.14E-01     ,
                (float) -2.22E-01
        },

        // 440
        {
                (float) 4.447664134   ,
                (float) -0.933628104  ,
                (float) -5.58E-01     ,
                (float) 2.99E-01      ,
                (float) 6.28E-02      ,
                (float) -8.74E-02     ,
                (float) 1.84E-01      ,
                (float) -8.70E-02     ,
                (float) 1.10E-01      ,
                (float) -1.45E-01     ,
                (float) -5.32E-02     ,
                (float) -9.26E-02     ,
                (float) 8.94E-02      ,
                (float) 7.03E-02      ,
                (float) -2.62E-01     ,
                (float) -2.37E-01
        },

        // 450
        {
                (float) 4.280419886   ,
                (float) -0.527435126  ,
                (float) -0.805433997  ,
                (float) 3.02E-01      ,
                (float) 1.64E-01      ,
                (float) -1.24E-01     ,
                (float) 1.24E-01      ,
                (float) -4.85E-02     ,
                (float) 1.12E-01      ,
                (float) -1.39E-01     ,
                (float) -1.06E-01     ,
                (float) -1.35E-01     ,
                (float) 4.57E-02      ,
                (float) 7.39E-02      ,
                (float) -1.80E-01     ,
                (float) -1.95E-01
        },

        // 460
        {
                (float) 3.808004543   ,
                (float) 0.070711345   ,
                (float) -1.000446352  ,
                (float) 1.64E-01      ,
                (float) 2.87E-01      ,
                (float) -1.06E-01     ,
                (float) 3.29E-02      ,
                (float) -2.46E-02     ,
                (float) 1.08E-01      ,
                (float) -1.25E-01     ,
                (float) -1.45E-01     ,
                (float) -1.72E-01     ,
                (float) -9.69E-03     ,
                (float) 6.55E-02      ,
                (float) -8.82E-02     ,
                (float) -1.08E-01
        },

        // 470
        {
                (float) 3.068395657   ,
                (float) 7.54E-01      ,
                (float) -1.033855476  ,
                (float) -1.46E-01     ,
                (float) 3.87E-01      ,
                (float) -1.49E-02     ,
                (float) -6.55E-02     ,
                (float) -3.35E-02     ,
                (float) 8.02E-02      ,
                (float) -1.18E-01     ,
                (float) -1.74E-01     ,
                (float) -1.91E-01     ,
                (float) -5.76E-02     ,
                (float) 5.68E-02      ,
                (float) 1.73E-02      ,
                (float) 1.79E-02
        },

        // 480
        {
                (float) 2.125233439   ,
                (float) 1.444179903   ,
                (float) -0.895332746  ,
                (float) -5.40E-01     ,
                (float) 3.96E-01      ,
                (float) 1.37E-01      ,
                (float) -1.35E-01     ,
                (float) -7.47E-02     ,
                (float) 2.23E-02      ,
                (float) -1.28E-01     ,
                (float) -1.94E-01     ,
                (float) -1.82E-01     ,
                (float) -7.71E-02     ,
                (float) 6.20E-02      ,
                (float) 1.26E-01      ,
                (float) 1.48E-01
        },

        // 490
        {
                (float) 1.04462108    ,
                (float) 2.077801223   ,
                (float) -0.621902305  ,
                (float) -0.874874127  ,
                (float) 2.42E-01      ,
                (float) 3.08E-01      ,
                (float) -1.42E-01     ,
                (float) -1.33E-01     ,
                (float) -6.48E-02     ,
                (float) -1.55E-01     ,
                (float) -2.07E-01     ,
                (float) -1.55E-01     ,
                (float) -6.71E-02     ,
                (float) 8.50E-02      ,
                (float) 2.30E-01      ,
                (float) 2.66E-01
        },

        // 500
        {
                (float) -0.042506258  ,
                (float) 2.521932029   ,
                (float) -0.203791685  ,
                (float) -1.050540175  ,
                (float) -9.10E-02     ,
                (float) 4.34E-01      ,
                (float) -7.11E-02     ,
                (float) -1.82E-01     ,
                (float) -1.74E-01     ,
                (float) -1.90E-01     ,
                (float) -2.02E-01     ,
                (float) -1.20E-01     ,
                (float) -5.12E-02     ,
                (float) 1.11E-01      ,
                (float) 3.25E-01      ,
                (float) 3.68E-01
        },

        // 510
        {
                (float) -9.75E-01     ,
                (float) 2.63753316    ,
                (float) 3.82E-01      ,
                (float) -1.061305779  ,
                (float) -5.11E-01     ,
                (float) 0.45120194    ,
                (float) 5.28E-02      ,
                (float) -1.88E-01     ,
                (float) -2.86E-01     ,
                (float) -2.25E-01     ,
                (float) -1.78E-01     ,
                (float) -8.02E-02     ,
                (float) -3.18E-02     ,
                (float) 1.33E-01      ,
                (float) 3.87E-01      ,
                (float) 4.30E-01
        },

        // 520
        {
                (float) -1.652261939  ,
                (float) 2.413878738   ,
                (float) 1.05E+00      ,
                (float) -0.907210663  ,
                (float) -0.882263065  ,
                (float) 0.307872428   ,
                (float) 1.85E-01      ,
                (float) -1.28E-01     ,
                (float) -3.66E-01     ,
                (float) -2.50E-01     ,
                (float) -1.33E-01     ,
                (float) -3.29E-02     ,
                (float) -2.00E-02     ,
                (float) 1.28E-01      ,
                (float) 3.92E-01      ,
                (float) 0.437496652
        },

        // 530
        {
                (float) -2.043438687  ,
                (float) 1.916793874   ,
                (float) 1.692066864   ,
                (float) -0.602079293  ,
                (float) -1.113822856  ,
                (float) 1.24E-02      ,
                (float) 2.78E-01      ,
                (float) -1.04E-03     ,
                (float) -3.78E-01     ,
                (float) -2.52E-01     ,
                (float) -8.02E-02     ,
                (float) 1.72E-02      ,
                (float) -2.11E-02     ,
                (float) 8.42E-02      ,
                (float) 3.36E-01      ,
                (float) 0.381761811
        },

        // 540
        {
                (float) -2.157411074  ,
                (float) 1.232919829   ,
                (float) 2.191694158   ,
                (float) -0.13308034   ,
                (float) -1.19657102   ,
                (float) -3.63E-01     ,
                (float) 2.84E-01      ,
                (float) 1.66E-01      ,
                (float) -3.06E-01     ,
                (float) -2.28E-01     ,
                (float) -4.09E-02     ,
                (float) 5.64E-02      ,
                (float) -2.49E-02     ,
                (float) 2.57E-02      ,
                (float) 2.27E-01      ,
                (float) 2.66E-01
        },

        // 550
        {
                (float) -2.045623588  ,
                (float) 0.495336943   ,
                (float) 2.430126457   ,
                (float) 4.68E-01      ,
                (float) -1.120655638  ,
                (float) -7.12E-01     ,
                (float) 1.63E-01      ,
                (float) 3.27E-01      ,
                (float) -1.55E-01     ,
                (float) -1.72E-01     ,
                (float) -1.72E-02     ,
                (float) 7.55E-02      ,
                (float) -2.86E-02     ,
                (float) -3.36E-02     ,
                (float) 8.46E-02      ,
                (float) 1.09E-01
        },

        // 560
        {
                (float) -1.783634083  ,
                (float) -0.179559145  ,
                (float) 2.363427385   ,
                (float) 1.099640862   ,
                (float) -0.869550913  ,
                (float) -0.955596291  ,
                (float) -8.14E-02     ,
                (float) 4.25E-01      ,
                (float) 4.69E-02      ,
                (float) -8.70E-02     ,
                (float) -5.76E-03     ,
                (float) 6.32E-02      ,
                (float) -3.35E-02     ,
                (float) -8.22E-02     ,
                (float) -5.68E-02     ,
                (float) -4.81E-02
        },

        // 570
        {
                (float) -1.449423666  ,
                (float) -7.07E-01     ,
                (float) 2.00891725    ,
                (float) 1.638159395   ,
                (float) -0.422837951  ,
                (float) -1.077632949  ,
                (float) -3.87E-01     ,
                (float) 0.418587326   ,
                (float) 2.54E-01      ,
                (float) 1.43E-02      ,
                (float) -1.04E-02     ,
                (float) 2.72E-02      ,
                (float) -3.53E-02     ,
                (float) -1.04E-01     ,
                (float) -1.67E-01     ,
                (float) -1.75E-01
        },

        // 580
        {
                (float) -1.105401056  ,
                (float) -1.061226328  ,
                (float) 1.473378127   ,
                (float) 1.966053463   ,
                (float) 0.17240856    ,
                (float) -1.060550995  ,
                (float) -6.65E-01     ,
                (float) 0.284831653   ,
                (float) 4.14E-01      ,
                (float) 1.26E-01      ,
                (float) -2.63E-02     ,
                (float) -2.22E-02     ,
                (float) -3.75E-02     ,
                (float) -1.02E-01     ,
                (float) -2.28E-01     ,
                (float) -2.50E-01
        },

        // 590
        {
                (float) -0.779969968  ,
                (float) -1.266170051  ,
                (float) 0.870265972   ,
                (float) 2.060600092   ,
                (float) 8.04E-01      ,
                (float) -0.890605415  ,
                (float) -0.847582726  ,
                (float) 4.41E-02      ,
                (float) 0.484253535   ,
                (float) 2.36E-01      ,
                (float) -3.72E-02     ,
                (float) -7.39E-02     ,
                (float) -4.53E-02     ,
                (float) -9.18E-02     ,
                (float) -2.36E-01     ,
                (float) -2.72E-01
        },

        // 600
        {
                (float) -0.486239809  ,
                (float) -1.345700452  ,
                (float) 0.263379896   ,
                (float) 1.9565988     ,
                (float) 1.374700048   ,
                (float) -0.573437226  ,
                (float) -0.912613328  ,
                (float) -2.50E-01     ,
                (float) 0.435748731   ,
                (float) 3.30E-01      ,
                (float) -2.74E-02     ,
                (float) -1.14E-01     ,
                (float) -5.68E-02     ,
                (float) -8.42E-02     ,
                (float) -2.06E-01     ,
                (float) -2.48E-01
        },

        // 610
        {
                (float) -0.235969319  ,
                (float) -1.312370778  ,
                (float) -3.05E-01     ,
                (float) 1.682731378   ,
                (float) 1.832814221   ,
                (float) -0.130299557  ,
                (float) -0.871100207  ,
                (float) -5.22E-01     ,
                (float) 0.261790878   ,
                (float) 3.80E-01      ,
                (float) 1.03E-02      ,
                (float) -1.32E-01     ,
                (float) -6.99E-02     ,
                (float) -7.91E-02     ,
                (float) -1.57E-01     ,
                (float) -1.94E-01
        },

        // 620
        {
                (float) -4.01E-02     ,
                (float) -1.179727419  ,
                (float) -7.86E-01     ,
                (float) 1.256198957   ,
                (float) 2.133416887   ,
                (float) 4.18E-01      ,
                (float) -0.724711833  ,
                (float) -0.722884461  ,
                (float) -7.59E-03     ,
                (float) 3.60E-01      ,
                (float) 6.28E-02      ,
                (float) -1.22E-01     ,
                (float) -7.87E-02     ,
                (float) -7.51E-02     ,
                (float) -1.06E-01     ,
                (float) -1.23E-01
        },

        // 630
        {
                (float) 9.89E-02      ,
                (float) -0.976809695  ,
                (float) -1.129951399  ,
                (float) 0.728644655   ,
                (float) 2.214456855   ,
                (float) 1.023963833   ,
                (float) -0.446792413  ,
                (float) -0.834433594  ,
                (float) -3.16E-01     ,
                (float) 2.61E-01      ,
                (float) 1.10E-01      ,
                (float) -8.98E-02     ,
                (float) -8.78E-02     ,
                (float) -7.31E-02     ,
                (float) -5.92E-02     ,
                (float) -6.04E-02
        },

        // 640
        {
                (float) 1.86E-01      ,
                (float) -0.737106181  ,
                (float) -1.315985797  ,
                (float) 0.17161405    ,
                (float) 2.062069935   ,
                (float) 1.594660001   ,
                (float) -0.024987324  ,
                (float) -0.841941708  ,
                (float) -5.90E-01     ,
                (float) 7.79E-02      ,
                (float) 1.32E-01      ,
                (float) -3.94E-02     ,
                (float) -9.93E-02     ,
                (float) -8.94E-02     ,
                (float) -2.49E-02     ,
                (float) -1.12E-02
        },

        // 650
        {
                (float) 2.26E-01      ,
                (float) -0.488464435  ,
                (float) -1.350149705  ,
                (float) -3.52E-01     ,
                (float) 1.706368035   ,
                (float) 2.042207197   ,
                (float) 5.17E-01      ,
                (float) -0.735278809  ,
                (float) -0.779493262  ,
                (float) -1.63E-01     ,
                (float) 1.04E-01      ,
                (float) 1.16E-02      ,
                (float) -1.06E-01     ,
                (float) -1.15E-01     ,
                (float) -1.29E-02     ,
                (float) 1.66E-02
        },

        // 660
        {
                (float) 2.28E-01      ,
                (float) -0.253448528  ,
                (float) -1.258185231  ,
                (float) -7.83E-01     ,
                (float) 1.191009454   ,
                (float) 2.304792584   ,
                (float) 1.124906264   ,
                (float) -0.49176165   ,
                (float) -0.869471462  ,
                (float) -4.28E-01     ,
                (float) 1.69E-02      ,
                (float) 3.91E-02      ,
                (float) -9.77E-02     ,
                (float) -1.44E-01     ,
                (float) -1.70E-02     ,
                (float) 1.25E-02
        },

        // 670
        {
                (float) 2.03E-01      ,
                (float) -5.05E-02     ,
                (float) -1.080532909  ,
                (float) -1.081526046  ,
                (float) 0.587738396   ,
                (float) 2.32950183    ,
                (float) 1.729567712   ,
                (float) -0.094943884  ,
                (float) -0.860294878  ,
                (float) -0.675690597  ,
                (float) -1.35E-01     ,
                (float) 1.77E-02      ,
                (float) -8.18E-02     ,
                (float) -1.64E-01     ,
                (float) -3.29E-02     ,
                (float) -1.52E-03
        },

        // 680
        {
                (float) 1.60E-01      ,
                (float) 1.14E-01      ,
                (float) -0.862320877  ,
                (float) -1.237766337  ,
                (float) -0.007825918  ,
                (float) 2.110296661   ,
                (float) 2.231538809   ,
                (float) 4.49E-01      ,
                (float) -0.741118454  ,
                (float) -0.864545503  ,
                (float) -3.34E-01     ,
                (float) -6.16E-02     ,
                (float) -7.79E-02     ,
                (float) -1.82E-01     ,
                (float) -4.53E-02     ,
                (float) -2.64E-02
        },

        // 690
        {
                (float) 1.08E-01      ,
                (float) 2.40E-01      ,
                (float) -0.639540415  ,
                (float) -1.275863067  ,
                (float) -5.22E-01     ,
                (float) 1.711889876   ,
                (float) 2.539292061   ,
                (float) 1.074097382   ,
                (float) -0.490490435  ,
                (float) -0.960244172  ,
                (float) -5.48E-01     ,
                (float) -2.03E-01     ,
                (float) -1.07E-01     ,
                (float) -2.09E-01     ,
                (float) -5.36E-02     ,
                (float) -4.09E-02
        },

        // 700
        {
                (float) 4.69E-02      ,
                (float) 3.31E-01      ,
                (float) -0.433007673  ,
                (float) -1.229344536  ,
                (float) -0.918929678  ,
                (float) 1.219055639   ,
                (float) 2.624542929   ,
                (float) 1.687061455   ,
                (float) -0.110039565  ,
                (float) -0.945386844  ,
                (float) -0.7386952    ,
                (float) -3.92E-01     ,
                (float) -1.76E-01     ,
                (float) -2.40E-01     ,
                (float) -5.48E-02     ,
                (float) -5.84E-02
        },

        // 710
        {
                (float) -2.21E-02     ,
                (float) 3.90E-01      ,
                (float) -0.254640292  ,
                (float) -1.127647322  ,
                (float) -1.189221807  ,
                (float) 0.699327255   ,
                (float) 2.500798076   ,
                (float) 2.210682935   ,
                (float) 3.74E-01      ,
                (float) -0.82199952   ,
                (float) -0.876065891  ,
                (float) -5.98E-01     ,
                (float) -2.83E-01     ,
                (float) -2.77E-01     ,
                (float) -5.60E-02     ,
                (float) -8.02E-02
        },

        // 720
        {
                (float) -1.02E-01     ,
                (float) 4.17E-01      ,
                (float) -1.12E-01     ,
                (float) -0.996275177  ,
                (float) -1.342323786  ,
                (float) 0.208161487   ,
                (float) 2.201983056   ,
                (float) 2.585453062   ,
                (float) 9.14E-01      ,
                (float) -0.60060945   ,
                (float) -0.953053861  ,
                (float) -0.795899883  ,
                (float) -4.09E-01     ,
                (float) -3.06E-01     ,
                (float) -5.20E-02     ,
                (float) -9.85E-02
        },

        // 730
        {
                (float) -1.95E-01     ,
                (float) 0.409371016   ,
                (float) -7.47E-03     ,
                (float) -0.853144292  ,
                (float) -1.395953177  ,
                (float) -2.19E-01     ,
                (float) 1.777436909   ,
                (float) 2.768110795   ,
                (float) 1.44894696    ,
                (float) -0.28959871   ,
                (float) -0.962826327  ,
                (float) -0.961237309  ,
                (float) -0.542371904  ,
                (float) -3.23E-01     ,
                (float) -4.01E-02     ,
                (float) -9.57E-02
        },

        // 740
        {
                (float) -3.00E-01     ,
                (float) 0.367063385   ,
                (float) 5.80E-02      ,
                (float) -0.712277759  ,
                (float) -1.37406444   ,
                (float) -5.63E-01     ,
                (float) 1.289330003   ,
                (float) 2.747850802   ,
                (float) 1.902810507   ,
                (float) 8.94E-02      ,
                (float) -0.897597098  ,
                (float) -1.068098835  ,
                (float) -0.665957856  ,
                (float) -3.32E-01     ,
                (float) -1.24E-02     ,
                (float) -5.92E-02
        },

        // 750
        {
                (float) -4.15E-01     ,
                (float) 2.95E-01      ,
                (float) 9.06E-02      ,
                (float) -0.582296006  ,
                (float) -1.300413411  ,
                (float) -0.82410497   ,
                (float) 0.795701256   ,
                (float) 2.550852174   ,
                (float) 2.225222459   ,
                (float) 5.01E-01      ,
                (float) -0.753274449  ,
                (float) -1.09825047   ,
                (float) -0.760623662  ,
                (float) -3.34E-01     ,
                (float) 2.40E-02      ,
                (float) -1.51E-03
        },

        // 760
        {
                (float) -0.536571985  ,
                (float) 1.94E-01      ,
                (float) 9.41E-02      ,
                (float) -0.46788664   ,
                (float) -1.192836825  ,
                (float) -1.009305133  ,
                (float) 0.32813242    ,
                (float) 2.211556896   ,
                (float) 2.38813663    ,
                (float) 0.903277841   ,
                (float) -0.538359632  ,
                (float) -1.047362137  ,
                (float) -0.809247643  ,
                (float) -3.17E-01     ,
                (float) 7.03E-02      ,
                (float) 7.91E-02
        },

        // 770
        {
                (float) -0.663097622  ,
                (float) 6.67E-02      ,
                (float) 7.07E-02      ,
                (float) -0.369844168  ,
                (float) -1.064881072  ,
                (float) -1.12748842   ,
                (float) -1.01E-01     ,
                (float) 1.777834164   ,
                (float) 2.388374983   ,
                (float) 1.253656527   ,
                (float) -0.268544208  ,
                (float) -0.918929678  ,
                (float) -0.80110392   ,
                (float) -2.77E-01     ,
                (float) 1.28E-01      ,
                (float) 1.87E-01
        },

        // 780
        {
                (float) -0.786842475  ,
                (float) -7.51E-02     ,
                (float) 3.06E-02      ,
                (float) -2.86E-01     ,
                (float) -0.927311753  ,
                (float) -1.195736785  ,
                (float) -4.80E-01     ,
                (float) 1.302916115   ,
                (float) 2.259426092   ,
                (float) 1.528596537   ,
                (float) 3.47E-02      ,
                (float) -0.716011954  ,
                (float) -0.735278809  ,
                (float) -2.21E-01     ,
                (float) 1.86E-01      ,
                (float) 2.92E-01
        },

        // 790
        {
                (float) -0.908918858  ,
                (float) -2.33E-01     ,
                (float) -2.56E-02     ,
                (float) -2.18E-01     ,
                (float) -0.788669847  ,
                (float) -1.22588842   ,
                (float) -0.796773844  ,
                (float) 0.810638034   ,
                (float) 2.00224337    ,
                (float) 1.694172315   ,
                (float) 3.53E-01      ,
                (float) -0.437893906  ,
                (float) -0.602913528  ,
                (float) -1.29E-01     ,
                (float) 2.44E-01      ,
                (float) 3.97E-01
        },

        // 800
        {
                (float) -1.022652892  ,
                (float) -3.96E-01     ,
                (float) -9.34E-02     ,
                (float) -1.60E-01     ,
                (float) -0.652451195  ,
                (float) -1.223624068  ,
                (float) -1.058604447  ,
                (float) 0.324557127   ,
                (float) 1.650593469   ,
                (float) 1.771438363   ,
                (float) 6.72E-01      ,
                (float) -0.111231329  ,
                (float) -0.417276385  ,
                (float) -1.77E-02     ,
                (float) 2.99E-01      ,
                (float) 4.97E-01
        },

        // 810
        {
                (float) -1.119424148  ,
                (float) -5.50E-01     ,
                (float) -1.58E-01     ,
                (float) -1.10E-01     ,
                (float) -0.521714658  ,
                (float) -1.201894234  ,
                (float) -1.277849341  ,
                (float) -1.20E-01     ,
                (float) 1.284125966   ,
                (float) 1.78875867    ,
                (float) 0.964534523   ,
                (float) 2.34E-01      ,
                (float) -0.19584659   ,
                (float) 9.73E-02      ,
                (float) 3.29E-01      ,
                (float) 0.552263548
        },

        // 820
        {
                (float) -1.206502389  ,
                (float) -0.703498429  ,
                (float) -2.28E-01     ,
                (float) -6.99E-02     ,
                (float) -0.399995804  ,
                (float) -1.164989268  ,
                (float) -1.45017845   ,
                (float) -5.25E-01     ,
                (float) 0.879283654   ,
                (float) 1.706169408   ,
                (float) 1.21035576    ,
                (float) 6.07E-01      ,
                (float) 7.51E-02      ,
                (float) 2.42E-01      ,
                (float) 3.64E-01      ,
                (float) 0.59473008
        },

        // 830
        {
                (float) -1.269864521  ,
                (float) -0.832645947  ,
                (float) -2.87E-01     ,
                (float) -3.26E-02     ,
                (float) -0.284434398  ,
                (float) -1.110247564  ,
                (float) -1.583338241  ,
                (float) -0.88599726   ,
                (float) 0.487948004   ,
                (float) 1.618376109   ,
                (float) 1.450416803   ,
                (float) 0.973711108   ,
                (float) 3.47E-01      ,
                (float) 3.57E-01      ,
                (float) 3.58E-01      ,
                (float) 0.570537266
        },

        // 840
        {
                (float) -1.315032385  ,
                (float) -0.944393707  ,
                (float) -3.38E-01     ,
                (float) -1.30E-03     ,
                (float) -1.80E-01     ,
                (float) -1.049745666  ,
                (float) -1.683009456  ,
                (float) -1.194386119  ,
                (float) 0.134669359   ,
                (float) 1.501225685   ,
                (float) 1.629419791   ,
                (float) 1.307762623   ,
                (float) 6.29E-01      ,
                (float) 4.81E-01      ,
                (float) 3.42E-01      ,
                (float) 0.512458622
        },

        // 850
        {
                (float) -1.346574412  ,
                (float) -1.045177236  ,
                (float) -3.88E-01     ,
                (float) 2.50E-02      ,
                (float) -8.42E-02     ,
                (float) -0.977405577  ,
                (float) -1.744623667  ,
                (float) -1.462215268  ,
                (float) -2.28E-01     ,
                (float) 1.339145748   ,
                (float) 1.781250555   ,
                (float) 1.637364886   ,
                (float) 0.930370615   ,
                (float) 0.608236741   ,
                (float) 3.21E-01      ,
                (float) 0.424228343
        },

        // 860
        {
                (float) -1.353168841  ,
                (float) -1.114617366  ,
                (float) -4.21E-01     ,
                (float) 4.93E-02      ,
                (float) 1.69E-03      ,
                (float) -0.901450469  ,
                (float) -1.778112242  ,
                (float) -1.677130086  ,
                (float) -5.25E-01     ,
                (float) 1.207098271   ,
                (float) 1.905789918   ,
                (float) 1.906425525   ,
                (float) 1.192956002   ,
                (float) 0.705206625   ,
                (float) 2.73E-01      ,
                (float) 0.291584983
        },

        // 870
        {
                (float) -1.355353742  ,
                (float) -1.187593063  ,
                (float) -0.460656603  ,
                (float) 6.48E-02      ,
                (float) 7.47E-02      ,
                (float) -0.822913206  ,
                (float) -1.781766986  ,
                (float) -1.853471468  ,
                (float) -0.834234966  ,
                (float) 1.003465488   ,
                (float) 1.955605663   ,
                (float) 2.150260488   ,
                (float) 1.479853379   ,
                (float) 0.843292374   ,
                (float) 2.69E-01      ,
                (float) 1.89E-01
        },

        // 880
        {
                (float) -1.331717084  ,
                (float) -1.224776107  ,
                (float) -0.482505614  ,
                (float) 7.98E-02      ,
                (float) 1.38E-01      ,
                (float) -0.74203214   ,
                (float) -1.75987825   ,
                (float) -1.978447811  ,
                (float) -1.07227001   ,
                (float) 0.85000598    ,
                (float) 1.997436588   ,
                (float) 2.327674458   ,
                (float) 1.70342835    ,
                (float) 0.933191123   ,
                (float) 2.32E-01      ,
                (float) 4.81E-02
        },

        // 890
        {
                (float) -1.308874937  ,
                (float) -1.270817932  ,
                (float) -0.515676386  ,
                (float) 8.58E-02      ,
                (float) 1.87E-01      ,
                (float) -0.663772955  ,
                (float) -1.714948738  ,
                (float) -2.069180795  ,
                (float) -1.318289874  ,
                (float) 0.623689951   ,
                (float) 1.947064686   ,
                (float) 2.460834249   ,
                (float) 1.942416805   ,
                (float) 1.079698674   ,
                (float) 2.64E-01      ,
                (float) -2.92E-02
        },

        // 900
        {
                (float) -1.259933152  ,
                (float) -1.278286321  ,
                (float) -0.52862689   ,
                (float) 9.18E-02      ,
                (float) 2.26E-01      ,
                (float) -0.585235692  ,
                (float) -1.646779823  ,
                (float) -2.107555603  ,
                (float) -1.488235454  ,
                (float) 0.456405977   ,
                (float) 1.903406389   ,
                (float) 2.530314104   ,
                (float) 2.094605098   ,
                (float) 1.157759231   ,
                (float) 2.61E-01      ,
                (float) -1.32E-01
        },

        // 910
        {
                (float) -1.213136543  ,
                (float) -1.293342276  ,
                (float) -0.551548489  ,
                (float) 8.90E-02      ,
                (float) 2.49E-01      ,
                (float) -0.512458622  ,
                (float) -1.560337191  ,
                (float) -2.114110306  ,
                (float) -1.654844095  ,
                (float) 0.228024224   ,
                (float) 1.769134285   ,
                (float) 2.549700135   ,
                (float) 2.24663449    ,
                (float) 1.284483495   ,
                (float) 3.27E-01      ,
                (float) -1.58E-01
        },

        // 920
        {
                (float) -1.140677277  ,
                (float) -1.268196051  ,
                (float) -0.551945744  ,
                (float) 8.66E-02      ,
                (float) 2.63E-01      ,
                (float) -0.441747277  ,
                (float) -1.454905781  ,
                (float) -2.068465736  ,
                (float) -1.736042965  ,
                (float) 6.67E-02      ,
                (float) 1.651229077   ,
                (float) 2.503737761   ,
                (float) 2.293470824   ,
                (float) 1.327863713   ,
                (float) 3.53E-01      ,
                (float) -1.94E-01
        },

        // 930
        {
                (float) -1.068654992  ,
                (float) -1.244082688  ,
                (float) -0.556911428  ,
                (float) 7.71E-02      ,
                (float) 2.62E-01      ,
                (float) -0.377789263  ,
                (float) -1.336364965  ,
                (float) -1.989849022  ,
                (float) -1.798213333  ,
                (float) -1.31E-01     ,
                (float) 1.455541389   ,
                (float) 2.404145996   ,
                (float) 2.325569008   ,
                (float) 1.402150351   ,
                (float) 4.31E-01      ,
                (float) -1.63E-01
        },

        // 940
        {
                (float) -0.974823421  ,
                (float) -1.182428751  ,
                (float) -0.540067827  ,
                (float) 6.79E-02      ,
                (float) 2.53E-01      ,
                (float) -3.18E-01     ,
                (float) -1.203959958  ,
                (float) -1.864197346  ,
                (float) -1.775132832  ,
                (float) -2.62E-01     ,
                (float) 1.277968517   ,
                (float) 2.240000335   ,
                (float) 2.248144058   ,
                (float) 1.396707961   ,
                (float) 0.476030362   ,
                (float) -1.32E-01
        },

        // 950
        {
                (float) -0.873761813  ,
                (float) -1.103057253  ,
                (float) -0.514643523  ,
                (float) 5.56E-02      ,
                (float) 2.33E-01      ,
                (float) -2.63E-01     ,
                (float) -1.059398956  ,
                (float) -1.699177724  ,
                (float) -1.707798152  ,
                (float) -3.81E-01     ,
                (float) 1.062894798   ,
                (float) 2.032395005   ,
                (float) 2.128927908   ,
                (float) 1.374263068   ,
                (float) 0.519450306   ,
                (float) -8.02E-02
        },

        // 960
        {
                (float) -0.758001781  ,
                (float) -0.994924511  ,
                (float) -0.473090677  ,
                (float) 4.33E-02      ,
                (float) 2.06E-01      ,
                (float) -2.13E-01     ,
                (float) -0.906177801  ,
                (float) -1.497888745  ,
                (float) -1.570069932  ,
                (float) -4.47E-01     ,
                (float) 0.852945665   ,
                (float) 1.768101423   ,
                (float) 1.923865009   ,
                (float) 1.29489157    ,
                (float) 0.541815748   ,
                (float) -1.91E-02
        },

        // 970
        {
                (float) -0.62571595   ,
                (float) -0.846192334  ,
                (float) -0.407583369  ,
                (float) 3.32E-02      ,
                (float) 1.74E-01      ,
                (float) -1.64E-01     ,
                (float) -0.738655474  ,
                (float) -1.251074371  ,
                (float) -1.361193387  ,
                (float) -0.450407431  ,
                (float) 0.660118211   ,
                (float) 1.4816013     ,
                (float) 1.656949545   ,
                (float) 1.136823906   ,
                (float) 0.494979413   ,
                (float) -3.51E-03
        },

        // 980
        {
                (float) -0.484690515  ,
                (float) -0.67672346   ,
                (float) -0.330913203  ,
                (float) 2.25E-02      ,
                (float) 1.35E-01      ,
                (float) -1.20E-01     ,
                (float) -0.565492131  ,
                (float) -0.977167224  ,
                (float) -1.100395646  ,
                (float) -0.413423014  ,
                (float) 0.463278485   ,
                (float) 1.145563511   ,
                (float) 1.328181517   ,
                (float) 0.943638923   ,
                (float) 0.436662417   ,
                (float) 2.53E-02
        },

        // 990
        {
                (float) -0.330118694  ,
                (float) -0.473368755  ,
                (float) -2.33E-01     ,
                (float) 1.41E-02      ,
                (float) 9.38E-02      ,
                (float) -7.71E-02     ,
                (float) -0.382953575  ,
                (float) -0.673863225  ,
                (float) -0.77766589   ,
                (float) -0.315817523  ,
                (float) 0.297543805   ,
                (float) 0.790894473   ,
                (float) 0.935376025   ,
                (float) 0.672552285   ,
                (float) 0.319392816   ,
                (float) 2.35E-02
        },

        // 1000
        {
                (float) -1.69E-01     ,
                (float) -0.247092452  ,
                (float) -1.23E-01     ,
                (float) 6.40E-03      ,
                (float) 4.77E-02      ,
                (float) -3.79E-02     ,
                (float) -1.94E-01     ,
                (float) -0.344817119  ,
                (float) -0.408377879  ,
                (float) -1.78E-01     ,
                (float) 1.36E-01      ,
                (float) 0.402419058   ,
                (float) 0.492754787   ,
                (float) 0.362296328   ,
                (float) 1.76E-01      ,
                (float) 1.70E-02
        }
};

// wavelengths and gains that get configured at startup
int hass_dflt_plns=3;
int hass_dflt_lmbda[3]={LAMBDA_600,LAMBDA_530,LAMBDA_460};

// original table
//float hass_dflt_gains[3]={(float)8192.0,(float)8192.0,(float)8192.0};
// table adjusted for Hassptr->okbpp handling
float hass_dflt_gains[3]={(float)1.0,(float)1.0,(float)1.0};

// float reconCoeffs[3][16];
typedef float reconCoeTbl[maxHassComp][numOfHassCh];
reconCoeTbl reconCoeffs;

// double *power= new double[colors]; // <---- [16]
// double power[16];
float hass_power[numOfHassCh];

// double *coef= new double[period*period*colors];  // <-- [8x8x16] = 1K
// double coef[8x8x16];
float hass_coef[repUnitSize*repUnitSize*numOfHassCh];

float shrink_coef[repUnitSize];
float zoom_coef[repUnitSize];

float shr_coef_sum[numOfHassCh];
float shr_retval[numOfHassCh];

// from gen_planeComb -- given we know repUnitSize is 8
// int combine_tap_center = repUnitSize/2;                    <-- 4
// int combine_tap_side   = repUnitSize/4;                    <-- 2
// int combine_tap = combine_tap_center + combine_tap_side;   <-- 6
// then this has 6 components
//  double*combine_coef = new double[combine_tap];
float combine_coef[6];

// int filterConfig[8][8];  // [y][x]
typedef int hassMosaic[repUnitSize][repUnitSize];

// Tom - my original guess was like this
//  arbitrary, I made it up
// hassMosaic filterConfig = {
//    {0x0,0x1,0x2,0x3,0x0,0x1,0x2,0x3},
//    {0x4,0x5,0x6,0x7,0x4,0x5,0x6,0x7},
//    {0x8,0x9,0xA,0xB,0x8,0x9,0xA,0xB},
//    {0xC,0xD,0xE,0xF,0xC,0xD,0xE,0xF},
//    {0x0,0x1,0x2,0x3,0x0,0x1,0x2,0x3},
//    {0x4,0x5,0x6,0x7,0x4,0x5,0x6,0x7},
//    {0x8,0x9,0xA,0xB,0x8,0x9,0xA,0xB},
//    {0xC,0xD,0xE,0xF,0xC,0xD,0xE,0xF}
//    };

// re-aligned for the test images we have
///
/// // from the gcc model provided by Atsugi,
/// //  the actual mosaic is more like this
/// hassMosaic filterConfig = {
///    {0xA,0x5,0x4,0x4,0x8,0xC,0x6,0x6},
///    {0xD,0x5,0xC,0x4,0xB,0xC,0xE,0x6},
///    {0x1,0x3,0xF,0x2,0x3,0x1,0xD,0x0},
///    {0x4,0x3,0xA,0x2,0x8,0x1,0x6,0x0},
///    {0x9,0xC,0x7,0x6,0xB,0x5,0x5,0x4},
///    {0xB,0xC,0xE,0x6,0xD,0x5,0xC,0x4},
///    {0x2,0x1,0xC,0x0,0x0,0x3,0xE,0x2},
///    {0x8,0x1,0x6,0x0,0x4,0x3,0xA,0x2}
///    };
///

hassMosaic filterConfig = {
        {0xC,0x6,0x6,  0xA,0x5,0x4,0x4,0x8},
        {0xC,0xE,0x6,  0xD,0x5,0xC,0x4,0xB},
        {0x1,0xD,0x0,  0x1,0x3,0xF,0x2,0x3},
        {0x1,0x6,0x0,  0x4,0x3,0xA,0x2,0x8},
        {0x5,0x5,0x4,  0x9,0xC,0x7,0x6,0xB},
        {0x5,0xC,0x4,  0xB,0xC,0xE,0x6,0xD},
        {0x3,0xE,0x2,  0x2,0x1,0xC,0x0,0x0},
        {0x3,0xA,0x2,  0x8,0x1,0x6,0x0,0x4}
};


short gammaLut[gammaTblLen] = {
        0,   1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,  14,  15,  16,  17,  18,  19,
        20,  21,  22,  23,  24,  25,  26,  27,  28,  29,  30,  31,  32,  33,  34,  35,  36,  37,  38,  39,
        40,  41,  42,  43,  44,  45,  46,  47,  48,  49,  50,  51,  52,  53,  54,  55,  56,  57,  58,  59,
        60,  61,  62,  63,  64,  65,  66,  67,  68,  69,  70,  71,  72,  73,  74,  75,  76,  77,  78,  79,
        80,  81,  82,  83,  84,  85,  86,  87,  88,  89,  90,  91,  92,  93,  94,  95,  96,  97,  98,  99,
        100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119,
        120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139,
        140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159,
        160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179,
        180, 181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 197, 198, 199,
        200, 201, 202, 203, 204, 205, 206, 207, 208, 209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219,
        220, 221, 222, 223, 224, 225, 226, 227, 228, 229, 230, 231, 232, 233, 234, 235, 236, 237, 238, 239,
        240, 241, 242, 243, 244, 245, 246, 247, 248, 249, 250, 251, 252, 253, 254, 255, 256, 257, 258, 259,
        260, 261, 262, 263, 264, 265, 266, 267, 268, 269, 270, 271, 272, 273, 274, 275, 276, 277, 278, 279,
        280, 281, 282, 283, 284, 285, 286, 287, 288, 289, 290, 291, 292, 293, 294, 295, 296, 297, 298, 299,
        300, 301, 302, 303, 304, 305, 306, 307, 308, 309, 310, 311, 312, 313, 314, 315, 316, 317, 318, 319,
        320, 321, 322, 323, 324, 325, 326, 327, 328, 329, 330, 331, 332, 333, 334, 335, 336, 337, 338, 339,
        340, 341, 342, 343, 344, 345, 346, 347, 348, 349, 350, 351, 352, 353, 354, 355, 356, 357, 358, 359,
        360, 361, 362, 363, 364, 365, 366, 367, 368, 369, 370, 371, 372, 373, 374, 375, 376, 377, 378, 379,
        380, 381, 382, 383, 384, 385, 386, 387, 388, 389, 390, 391, 392, 393, 394, 395, 396, 397, 398, 399,
        400, 401, 402, 403, 404, 405, 406, 407, 408, 409, 410, 411, 412, 413, 414, 415, 416, 417, 418, 419,
        420, 421, 422, 423, 424, 425, 426, 427, 428, 429, 430, 431, 432, 433, 434, 435, 436, 437, 438, 439,
        440, 441, 442, 443, 444, 445, 446, 447, 448, 449, 450, 451, 452, 453, 454, 455, 456, 457, 458, 459,
        460, 461, 462, 463, 464, 465, 466, 467, 468, 469, 470, 471, 472, 473, 474, 475, 476, 477, 478, 479,
        480, 481, 482, 483, 484, 485, 486, 487, 488, 489, 490, 491, 492, 493, 494, 495, 496, 497, 498, 499,
        500, 501, 502, 503, 504, 505, 506, 507, 508, 509, 510, 511, 512, 513, 514, 515, 516, 517, 518, 519,
        520, 521, 522, 523, 524, 525, 526, 527, 528, 529, 530, 531, 532, 533, 534, 535, 536, 537, 538, 539,
        540, 541, 542, 543, 544, 545, 546, 547, 548, 549, 550, 551, 552, 553, 554, 555, 556, 557, 558, 559,
        560, 561, 562, 563, 564, 565, 566, 567, 568, 569, 570, 571, 572, 573, 574, 575, 576, 577, 578, 579,
        580, 581, 582, 583, 584, 585, 586, 587, 588, 589, 590, 591, 592, 593, 594, 595, 596, 597, 598, 599,
        600, 601, 602, 603, 604, 605, 606, 607, 608, 609, 610, 611, 612, 613, 614, 615, 616, 617, 618, 619,
        620, 621, 622, 623, 624, 625, 626, 627, 628, 629, 630, 631, 632, 633, 634, 635, 636, 637, 638, 639,
        640, 641, 642, 643, 644, 645, 646, 647, 648, 649, 650, 651, 652, 653, 654, 655, 656, 657, 658, 659,
        660, 661, 662, 663, 664, 665, 666, 667, 668, 669, 670, 671, 672, 673, 674, 675, 676, 677, 678, 679,
        680, 681, 682, 683, 684, 685, 686, 687, 688, 689, 690, 691, 692, 693, 694, 695, 696, 697, 698, 699,
        700, 701, 702, 703, 704, 705, 706, 707, 708, 709, 710, 711, 712, 713, 714, 715, 716, 717, 718, 719,
        720, 721, 722, 723, 724, 725, 726, 727, 728, 729, 730, 731, 732, 733, 734, 735, 736, 737, 738, 739,
        740, 741, 742, 743, 744, 745, 746, 747, 748, 749, 750, 751, 752, 753, 754, 755, 756, 757, 758, 759,
        760, 761, 762, 763, 764, 765, 766, 767, 768, 769, 770, 771, 772, 773, 774, 775, 776, 777, 778, 779,
        780, 781, 782, 783, 784, 785, 786, 787, 788, 789, 790, 791, 792, 793, 794, 795, 796, 797, 798, 799,
        800, 801, 802, 803, 804, 805, 806, 807, 808, 809, 810, 811, 812, 813, 814, 815, 816, 817, 818, 819,
        820, 821, 822, 823, 824, 825, 826, 827, 828, 829, 830, 831, 832, 833, 834, 835, 836, 837, 838, 839,
        840, 841, 842, 843, 844, 845, 846, 847, 848, 849, 850, 851, 852, 853, 854, 855, 856, 857, 858, 859,
        860, 861, 862, 863, 864, 865, 866, 867, 868, 869, 870, 871, 872, 873, 874, 875, 876, 877, 878, 879,
        880, 881, 882, 883, 884, 885, 886, 887, 888, 889, 890, 891, 892, 893, 894, 895, 896, 897, 898, 899,
        900, 901, 902, 903, 904, 905, 906, 907, 908, 909, 910, 911, 912, 913, 914, 915, 916, 917, 918, 919,
        920, 921, 922, 923, 924, 925, 926, 927, 928, 929, 930, 931, 932, 933, 934, 935, 936, 937, 938, 939,
        940, 941, 942, 943, 944, 945, 946, 947, 948, 949, 950, 951, 952, 953, 954, 955, 956, 957, 958, 959,
        960, 961, 962, 963, 964, 965, 966, 967, 968, 969, 970, 971, 972, 973, 974, 975, 976, 977, 978, 979,
        980, 981, 982, 983, 984, 985, 986, 987, 988, 989, 990, 991, 992, 993, 994, 995, 996, 997, 998, 999,
        1000,1001,1002,1003,1004,1005,1006,1007,1008,1009,1010,1011,1012,1013,1014,1015,1016,1017,1018,1019,
        1020,1021,1022,1023};

FILE* f_rawin;
char rawin_fname[]="/storage/emulated/0/Dropbox/raw001.bin";

char testrec_key='A';
float tol_reconCoeffs= ((float)0.0000001);    // raw001
float tol_plnguide=    ((float)0.000020);     // raw001
float tol_plnshrink=   ((float)0.000001);     // raw001
float tol_planeNR=     ((float)0.000020);     // raw001
float tol_plnrecon=    ((float)0.000200);     // raw001
float tol_plncomb=     ((float)0.000020);     // raw001
float tol_plnproc=     ((float)0.000200);     // raw001
short tol_plnoutput=   1;                     // raw001


short tst_inframe[H_def_HEIGHT*H_def_WIDTH];

FILE* f_hasscoef;
char hasscoef_fname[]="/storage/emulated/0/DCIM/__hass_coef.dat";

FILE* f_reconcoe;
char reconcoe_fname[]="/storage/emulated/0/DCIM/__reconcoe.dat";

FILE* f_plnguide;
char plnguide_fname[]="/storage/emulated/0/DCIM/__plnguide.dat";

FILE* f_plnshrink;
char plnshrink_fname[]="/storage/emulated/0/DCIM/__plnshrink.dat";

FILE* f_plnnrfnc;
char plnnrfnc_fname[]="/storage/emulated/0/DCIM/__plnnrfnc.dat";

FILE* f_plnrecon;
char plnrecon_fname[]="/storage/emulated/0/DCIM/__plnrecon.dat";

FILE* f_plncomb;
char plncomb_fname[]="/storage/emulated/0/DCIM/__plncomb.dat";

FILE* f_plnproc;
char plnproc_fname[]="/storage/emulated/0/DCIM/__plnproc.dat";

FILE* f_plnoutput;
char plnoutput_fname[]="/storage/emulated/0/DCIM/__plnoutput.dat";

FILE* f_rgboutput;
char rgboutput_fname[]="/storage/emulated/0/DCIM/__rgboutput.dat";

// thread3 has two of these to issue reports to thread0
//  it will never deploy more than one
//   but it has to autoadvance to the next when report is suued
hass_timer hasstmr_pool[2];

// the thread0 measurement system is initialized
//  to start idle
hass_tmracc hasstmracc={
        {(void*)0,(void*)0},       // chn
        0,                         // numfr
        0,                         // frnum
        0,                         // tstrt
        0,                         // tcoeptr
        0,                         // tguide
        0,                         // tshrink
        0,                         // tNR
        0,                         // trecon
        0,                         // tapp
        0,                         // tcomb
        0,                         // tproc
        0                          // tout
};




// 1   MB 0x00100000
// 256 MB 0x10000000
#define  OCL_SVM_SIZE     0x10000000

//
// 2Mpix                                         N=3   N=16
//
// reconCoeff     [N][16] sizeof(float)          192  1024
//
// input frame    [x][y] sizeof(short)            4M    4M
// planeGuide     [x][y] sizeof((float)           8M    8M      * ----------| independent of N
// planeShrink    [16][x/8][y/8] sizeof(float)    2M    2M                  |
// planeNR        [16][x/8][y/8] sizeof(float)    2M    2M                  |
// planeRecon     [N][x/8][y/8] sizeof(float)   .375M   2M                  |
//      App       [N][x/8][y/8] sizeof(float)   .375M   2M - extends Recon  |
//                                                                          |
// planeComb      [x][y] sizeof((float)           8M    8M      * ----------|
//
// planeProc      [N][x][y] sizeof(float)        24M  128M
//
// planesOutput   [N][x][y] sizeof(short)        12M   64M
//

// allow for 240 integer parameters - should never need that many
#define  SVMOFF_PRMS      0x00000000
#define  SVMMAX_PRMS      0x000003C0
//
// [0] width
// [1] height
// [2] width-1
// [3] height-1
// [4] width/8
// [5] height/8
// [6] (width/8)-1
// [7] (height/8)-1
// [8] numOfPlanes N
// [9] nrTapSize/2
// [10] gamma_mode   1 enabled / 0 disabled
// [11] gammalen-1
//

// plain gains    [N] sizeof(float) - max N=16 -> 64 bytes
#define  SVMOFF_PLGAIN    0x000003C0
#define  SVMMAX_PLGAIN    0x00000040
//#define  SVMOFF_PLGAIN    0x00090000
//#define  SVMMAX_PLGAIN    0x00010000

// reconCoeff     [N][16] sizeof(float) - max N=16 -> 1024 bytes
#define  SVMOFF_RECON     0x00000400
#define  SVMMAX_RECON     0x00000400
//#define  SVMOFF_RECON     0x000A0000
//#define  SVMMAX_RECON     0x00010000

// filterConfig[][] -- it's currently 8x8 = 64 int's -> 256 bytes
// we'll allocate SVM memory space to allow 16x16 = 256 int's -> 1024 bytes
#define  SVMOFF_FCONFIG   0x00000800
#define  SVMMAX_FCONFIG   0x00000400
//#define  SVMOFF_FCONFIG   0x000B0000
//#define  SVMMAX_FCONFIG   0x00010000

// shrink_coef[8]
//  it's a vector used in 2 dimension
//   if we want to precalculate 8x8, allocate enough room for 64 floats's
//    well hey, if we expand to 16x16, it's 256 int's again
// but the current direct implementation only uses
#define  SVMOFF_SHRCOE    0x00000C00
#define  SVMMAX_SHRCOE    0x00000400
//#define  SVMOFF_SHRCOE    0x000C0000
//#define  SVMMAX_SHRCOE    0x00010000

// combine_coef[6]
//  it's a vector used in 2 dimension
//   if we want to precalculate 8x8, allocate enough room for 64 floats's
//    well hey, if we expand to 16x16, it's 256 int's again
// but the current direct implementation only uses
#define  SVMOFF_CMBCOE    0x00001000
#define  SVMMAX_CMBCOE    0x00000400
//#define  SVMOFF_CMBCOE    0x000D0000
//#define  SVMMAX_CMBCOE    0x00010000

// combine_coef[6]
//  it's a vector used in 2 dimension
//   if we want to precalculate 8x8, allocate enough room for 64 floats's
//    well hey, if we expand to 16x16, it's 256 int's again
// but the current direct implementation only uses
#define  SVMOFF_ZMCOE     0x00001400
#define  SVMMAX_ZMCOE     0x00000400
//#define  SVMOFF_ZMCOE     0x000E0000
//#define  SVMMAX_ZMCOE     0x00010000
// next offset 0x00001800

// unallocated 0x00001800 .. 0x00003FFF

// float hass_coef[repUnitSize*repUnitSize*numOfHassCh];
//  8x8x16 = 1K floats -> 4KB
//   we'll allocate SVM for 16x16x16 = 4K floats -> 16 KB
#define  SVMOFF_HCOEF     0x00004000
#define  SVMMAX_HCOEF     0x00004000
//#define  SVMOFF_HCOEF     0x000F0000
//#define  SVMMAX_HCOEF     0x00010000
// next offset 0x00008000

// unallocated 0x00008000 .. 0x000FFFFF

// input frame is 2 Mpix of short - 4MB
//  start on a 1 MB  boundary
#define  SVMOFF_IFRM      0x00100000
#define  SVMMAX_IFRM      0x00400000

// planeGuide is 2 Mpix of float - 8MB
#define  SVMOFF_PLNGD     0x00500000
#define  SVMMAX_PLNGD     0x00800000

// a note on h/8 w/8 planes
// we'll use (h/8)+1 and (w/8)+1
// so 241 x 136 = 32776
//  x 4 bytes per float -> 131104
//  x 16 planes (color or N) -> 2097664 = 0x200200
// round that up to 64K boundary = use 0x210000

// planeShrink    [16][x/8][y/8] sizeof(float)    2MB
#define  SVMOFF_PLNSHR    0x00D00000
#define  SVMMAX_PLNSHR    0x00210000

// planeNR        [16][x/8][y/8] sizeof(float)    2MB
#define  SVMOFF_PLNNR     0x00F10000
#define  SVMMAX_PLNNR     0x00210000
// next offset 0x01100000

// planeRecon     [N][x/8][y/8] sizeof(float)     2M (N=16)
#define  SVMOFF_PLNRCN    0x01120000
#define  SVMMAX_PLNRCN    0x00210000

// planeApp       [N][x/8][y/8] sizeof(float)     2M (N=16)
#define  SVMOFF_PLNAPP    0x01330000
#define  SVMMAX_PLNAPP    0x00210000

// planeComb      [x][y] sizeof((float)           8M (N=16)
#define  SVMOFF_PLNCMB    0x01540000
#define  SVMMAX_PLNCMB    0x00800000

//
// gamma table(s) -- current implementation is 1024 (10 bit) shorts, for 2KB
//  now suppose - we want 12,14,16 bit lookups
//    then worst case would need 128 KB for a 16 bit short translation table
//     then really way out there, suppose all 16 Nplns use different tables
//      then worst case is 16 x 128 KB -> 2MB
//
// I really don't think there is much merit in that
//  eventually the display is like ARGB_8888 - so where's the benefit in
//   huge gamma tables and high resolution pixels?
//    having said that, we have the memory available to allocate 2MB
//
#define  SVMOFF_GAMMA     0x01D40000
#define  SVMMAX_GAMMA     0x00200000

// a second input frame, so we can use them as ping-pong buffers
//  we could really provide more for queuing, but we want unavailable buffers
//   to drop frames to stay current... not have a backlog of stale frames
//    they are all the same size allocation
#define  SVMOFF_IFRM2     0x01F40000
// #define  SVMMAX_IFRM      0x00400000
// next offset 0x02340000

// unallocated 0x02340000 .. 0x03FFFFFF

// planesOutput   [N][x][y] sizeof(short)        64M (N=16)
#define  SVMOFF_PLNOUT    0x04000000
#define  SVMMAX_PLNOUT    0x04000000

// planeProc      [N][x][y] sizeof(float)       128M (N=16)
#define  SVMOFF_PLNPRC    0x08000000
#define  SVMMAX_PLNPRC    0x08000000
// next offset 0x10000000


typedef struct {
    // each kernel should either have a filename (which gets loaded to ksrc/klen)
    //  or the kernel source text file has already been included in a resident memory
    //   array (ksrc) of size klen
    char*           kfilename;
    char*           ksrc;
    u32             klen;
    u32             spr;
    char*           kname;
    cl_program      program;
    cl_kernel       kernel;
    void(*fnc)(void);
} CL_proc_ctrl;

typedef enum {
    HASS_KINDX_PLANEGUID0=0,
    HASS_KINDX_PLANEGUID1,
    HASS_KINDX_SHR0,
    HASS_KINDX_SHR1,
    HASS_KINDX_SHR2,
    HASS_KINDX_SHR3,
    HASS_KINDX_SHR4,
    HASS_KINDX_SHR5,
    HASS_KINDX_NRF0,
    HASS_KINDX_NRF1,
    HASS_KINDX_PLANERECON,
    HASS_KINDX_PLANECMB0,
    HASS_KINDX_PLANECMB1,
    HASS_KINDX_ZOOM,
    HASS_KINDX_POST
} HASS_KINDX;

typedef struct {
    int              width;                      // 0x00
    int              height;                     // 0x04
    int              numPlane;                   // 0x08
    int              nrTapSize;                  // 0x0C
    int              gamma_en;                   // 0x10
    int              okbpp;                      // 0x14  (always >= 8)
    u32              spr[6];                     // 0x18..0x2F
    hassMosaic*      mosaicptr;                  // 0x30
    lutWaveConfig*   waveMix;                    // 0x38
    short*           gammaptr;                   // 0x40
    short*           planeHassRaw;               // 0x48
    short*           planesOutput;               // 0x50
    //--------------------------------------------------
    reconCoeTbl*     reconCoeptr;                // 0x58
    float*           planeGuide;                 // 0x60
    float*           planeShrink;                // 0x68
    float*           planeNR;                    // 0x70
    float*           planeRecon;                 // 0x78
    float*           planeComb;                  // 0x80
    float*           planeProc;                  // 0x88
    //--------------------------------------------------
    void*            svmbase;                    // 0x0090
    float            postGainPln[maxHassComp];   // 0x98..0xD7
    int              waveLngthTbl[maxHassComp];  // 0xD8..0x0117
    u32              hrsrv[30];                  // 0x0118..0x018F
    //--------------------------------------------------
} Hass_ctrl;                                  // 0x190 final size

//   1 MB =   0x100000
// 256 MB = 0x10000000
#define  shrMEM_size      (0x10000000)

// shrMEM_ptr as a void* always points here
//  the Application Control Block is always at the start of the shared memeory
//   and the rest is used for app_malloc() memctrl
#define  ACB_FIXED_SIZE   (0x10000)

// alc_state is Java Activity life cycle state
//  all threads can observe the os state of the android interface

typedef struct {
    memctrl*       memc;         // 0x0000
    volatile int   hwsema_crsh;  // 0x0008
    volatile u32   crsh_code;    // 0x000C

    int            vwdim;        // 0x0010 dimensions of texture/ImgVw y||x
    int            vwpix;        // 0x0014 pixels of texture/ImgVw    (y*x)

    u32            thr1flgs;     // 0x0018
    u32            hassoblk;     // 0x001C
    u16            hasscaptr;    // 0x0020
    u16            hasstmren;    // 0x0022
    u32            hasstmridx;   // 0x0024

    u8             ibm_msk;      // 0x0028

    // circular logical index for output raw sanpshots
    //  this variable owned by thread1. cfe_file_image()
    u8             snpraw;       // 0x0029

    // circular logical index for output rgb sanpshots
    //  this variable owned by thread2. cofl_file_image()
    u8             snprgb;       // 0x002A

    u8             tmp_tbd;      // 0x002B

    volatile u32   alc_state;    // 0x002C

    int            tmr_zoff;     // 0x0030
    volatile int   tmr_cnt;      // 0x0034
    volatile int   thr0cnt;      // 0x0038

    volatile int   hwsema_cam;   // 0x003C

    lnklst         gblkhead;     // 0x0040..0x004F
    volatile int   hwsema_gblk;  // 0x0050

    volatile int   shtdn_tstmp;  // 0x54
    volatile int   shtdn_timer;  // 0x58

    // <tbd>
    u32            cifc_tbd;     // 0x005C

    lnklst         coflpool;     // 0x0060..0x006F  color output file carrier pool

    // Hass_ctrl
    Hass_ctrl      hass_base;    // 0x0070..0x01FF

    // general scratch variable area
    u32            uvar[128];    // 0x0200..0x03FF
    u32            uvar_x[128];  // 0x0400..0x05FF
    u32            uvar_y[128];  // 0x0600..0x07FF

    // J2J (Jni2Java) command flow
    jni2java_ctrl  j2jctrl;      // 0x0800..0x083F
    lnklst*        olxchg;       // 0x0840..0x0847 next element in open loop xchg ring

    u32            spr848;       // <unused>
    u32            spr84c;       // <unused>

    volatile int   hwsema_olx;   // 0x0850..0x0853
    u32            olx_spr[43];  // 0x0854..0x08FF


    UTP_ctrl       utpbase;      // 0x0900..0x0AFF

    FTU_ctrl       ftubase;      // 0x0B00..0x0BFF

    // Reserved for read/write for USB2
    u32            usb2[0x500];  // 0x0C00..0x1FFF

    // ALS data sent through USB3
    als            usbmainals;   // 0x2000 main ALS in USB3 data
    als            usbslaveals;  // 0x2010 slave ALS in USB3 data

    als            slaveals;     // 0x2020 slave ALS

    // Location data sent through USB3
    location       gps;          // 0x2030 GPS location

    u32            tbd[0x36E8];  // 0x2060..0xFBFF
    //
    // at 0x80 per thread and threads.h MUTHREADNUM = 8
    //  we have 0x400 bytes      // 0xFC00..0xFFFF
    //   if you move this boundary, it has to be co-ordinated
    //    with threads.h
    // #define  MU_THREADNUM     (8)
    // #define  thr_ctrl         ((thread_ctrl*)(((u64)shrMEM_ptr)+0xFC00))
    //                                                               ^^^^
} AppCtrlBlk;                // preserve ACB_FIXED_SIZE

#define  ACptr            ((AppCtrlBlk*)shrMEM_ptr)
#define  Hassptr          ((Hass_ctrl*)(&(ACptr->hass_base)))
#define  utpptr           ((UTP_ctrl*)(&(ACptr->utpbase)))
#define  ftuptr           ((FTU_ctrl*)(&(ACptr->ftubase)))

//------------------------------------------------------------------------------
//  ansi's


void lnklst_init(lnklst* head);
void lnklst_fins(lnklst* pred,lnklst* ins);
void lnklst_rins(lnklst* succ,lnklst* ins);
void lnklst_drop(lnklst* dropitem);
